twitchyliquid64/samd10_boilerplate/compiled_samd10d13a.h
static inline void NVIC_SystemReset(void)
{
  __DSB();

  ((SCB_Type *) ((0xE000E000UL) + 0x0D00UL) )->AIRCR = ((0x5FA << 16) |
                 (1UL << 2));
  __DSB();
  while(1);
}
# 752 "include/core_cm0plus.h"
static inline uint32_t SysTick_Config(uint32_t ticks)
{
  if (ticks > (0xFFFFFFUL << 0)) return (1);

  ((SysTick_Type *) ((0xE000E000UL) + 0x0010UL) )->LOAD = (ticks & (0xFFFFFFUL << 0)) - 1;
  NVIC_SetPriority (SysTick_IRQn, (1<<2) - 1);
  ((SysTick_Type *) ((0xE000E000UL) + 0x0010UL) )->VAL = 0;
  ((SysTick_Type *) ((0xE000E000UL) + 0x0010UL) )->CTRL = (1UL << 2) |
                   (1UL << 1) |
                   (1UL << 0);
  return (0);
}
# 213 "include/samd10c13a.h" 2
# 225 "include/samd10c13a.h"
# 1 "include/component/ac.h" 1
# 61 "include/component/ac.h"
typedef union {
  struct {
    uint8_t SWRST:1;
    uint8_t ENABLE:1;
    uint8_t RUNSTDBY:1;
    uint8_t :4;
    uint8_t LPMUX:1;
  } bit;
  uint8_t reg;
} AC_CTRLA_Type;
# 89 "include/component/ac.h"
typedef union {
  struct {
    uint8_t START0:1;
    uint8_t START1:1;
    uint8_t :6;
  } bit;
  struct {
    uint8_t START:2;
    uint8_t :6;
  } vec;
  uint8_t reg;
} AC_CTRLB_Type;
# 117 "include/component/ac.h"
typedef union {
  struct {
    uint16_t COMPEO0:1;
    uint16_t COMPEO1:1;
    uint16_t :2;
    uint16_t WINEO0:1;
    uint16_t :3;
    uint16_t COMPEI0:1;
    uint16_t COMPEI1:1;
    uint16_t :6;
  } bit;
  struct {
    uint16_t COMPEO:2;
    uint16_t :2;
    uint16_t WINEO:1;
    uint16_t :3;
    uint16_t COMPEI:2;
    uint16_t :6;
  } vec;
  uint16_t reg;
} AC_EVCTRL_Type;
# 166 "include/component/ac.h"
typedef union {
  struct {
    uint8_t COMP0:1;
    uint8_t COMP1:1;
    uint8_t :2;
    uint8_t WIN0:1;
    uint8_t :3;
  } bit;
  struct {
    uint8_t COMP:2;
    uint8_t :2;
    uint8_t WIN:1;
    uint8_t :3;
  } vec;
  uint8_t reg;
} AC_INTENCLR_Type;
# 203 "include/component/ac.h"
typedef union {
  struct {
    uint8_t COMP0:1;
    uint8_t COMP1:1;
    uint8_t :2;
    uint8_t WIN0:1;
    uint8_t :3;
  } bit;
  struct {
    uint8_t COMP:2;
    uint8_t :2;
    uint8_t WIN:1;
    uint8_t :3;
  } vec;
  uint8_t reg;
} AC_INTENSET_Type;
# 240 "include/component/ac.h"
typedef union {
  struct {
    volatile const uint8_t COMP0:1;
    volatile const uint8_t COMP1:1;
    volatile const uint8_t :2;
    volatile const uint8_t WIN0:1;
    volatile const uint8_t :3;
  } bit;
  struct {
    volatile const uint8_t COMP:2;
    volatile const uint8_t :2;
    volatile const uint8_t WIN:1;
    volatile const uint8_t :3;
  } vec;
  uint8_t reg;
} AC_INTFLAG_Type;
# 277 "include/component/ac.h"
typedef union {
  struct {
    uint8_t STATE0:1;
    uint8_t STATE1:1;
    uint8_t :2;
    uint8_t WSTATE0:2;
    uint8_t :2;
  } bit;
  struct {
    uint8_t STATE:2;
    uint8_t :6;
  } vec;
  uint8_t reg;
} AC_STATUSA_Type;
# 316 "include/component/ac.h"
typedef union {
  struct {
    uint8_t READY0:1;
    uint8_t READY1:1;
    uint8_t :5;
    uint8_t SYNCBUSY:1;
  } bit;
  struct {
    uint8_t READY:2;
    uint8_t :6;
  } vec;
  uint8_t reg;
} AC_STATUSB_Type;
# 347 "include/component/ac.h"
typedef union {
  struct {
    uint8_t STATE0:1;
    uint8_t STATE1:1;
    uint8_t :2;
    uint8_t WSTATE0:2;
    uint8_t :2;
  } bit;
  struct {
    uint8_t STATE:2;
    uint8_t :6;
  } vec;
  uint8_t reg;
} AC_STATUSC_Type;
# 386 "include/component/ac.h"
typedef union {
  struct {
    uint8_t WEN0:1;
    uint8_t WINTSEL0:2;
    uint8_t :5;
  } bit;
  uint8_t reg;
} AC_WINCTRL_Type;
# 416 "include/component/ac.h"
typedef union {
  struct {
    uint32_t ENABLE:1;
    uint32_t SINGLE:1;
    uint32_t SPEED:2;
    uint32_t :1;
    uint32_t INTSEL:2;
    uint32_t :1;
    uint32_t MUXNEG:3;
    uint32_t :1;
    uint32_t MUXPOS:2;
    uint32_t :1;
    uint32_t SWAP:1;
    uint32_t OUT:2;
    uint32_t :1;
    uint32_t HYST:1;
    uint32_t :4;
    uint32_t FLEN:3;
    uint32_t :5;
  } bit;
  uint32_t reg;
} AC_COMPCTRL_Type;
# 521 "include/component/ac.h"
typedef union {
  struct {
    uint8_t VALUE:6;
    uint8_t :2;
  } bit;
  uint8_t reg;
} AC_SCALER_Type;
# 540 "include/component/ac.h"
typedef struct {
  volatile AC_CTRLA_Type CTRLA;
  volatile AC_CTRLB_Type CTRLB;
  volatile AC_EVCTRL_Type EVCTRL;
  volatile AC_INTENCLR_Type INTENCLR;
  volatile AC_INTENSET_Type INTENSET;
  volatile AC_INTFLAG_Type INTFLAG;
       RoReg8 Reserved1[0x1];
  volatile const AC_STATUSA_Type STATUSA;
  volatile const AC_STATUSB_Type STATUSB;
  volatile const AC_STATUSC_Type STATUSC;
       RoReg8 Reserved2[0x1];
  volatile AC_WINCTRL_Type WINCTRL;
       RoReg8 Reserved3[0x3];
  volatile AC_COMPCTRL_Type COMPCTRL[2];
       RoReg8 Reserved4[0x8];
  volatile AC_SCALER_Type SCALER[2];
} Ac;
# 226 "include/samd10c13a.h" 2
# 1 "include/component/adc.h" 1
# 61 "include/component/adc.h"
typedef union {
  struct {
    uint8_t SWRST:1;
    uint8_t ENABLE:1;
    uint8_t RUNSTDBY:1;
    uint8_t :5;
  } bit;
  uint8_t reg;
} ADC_CTRLA_Type;
# 85 "include/component/adc.h"
typedef union {
  struct {
    uint8_t REFSEL:4;
    uint8_t :3;
    uint8_t REFCOMP:1;
  } bit;
  uint8_t reg;
} ADC_REFCTRL_Type;
# 117 "include/component/adc.h"
typedef union {
  struct {
    uint8_t SAMPLENUM:4;
    uint8_t ADJRES:3;
    uint8_t :1;
  } bit;
  uint8_t reg;
} ADC_AVGCTRL_Type;
# 162 "include/component/adc.h"
typedef union {
  struct {
    uint8_t SAMPLEN:6;
    uint8_t :2;
  } bit;
  uint8_t reg;
} ADC_SAMPCTRL_Type;
# 181 "include/component/adc.h"
typedef union {
  struct {
    uint16_t DIFFMODE:1;
    uint16_t LEFTADJ:1;
    uint16_t FREERUN:1;
    uint16_t CORREN:1;
    uint16_t RESSEL:2;
    uint16_t :2;
    uint16_t PRESCALER:3;
    uint16_t :5;
  } bit;
  uint16_t reg;
} ADC_CTRLB_Type;
# 241 "include/component/adc.h"
typedef union {
  struct {
    uint8_t WINMODE:3;
    uint8_t :5;
  } bit;
  uint8_t reg;
} ADC_WINCTRL_Type;
# 270 "include/component/adc.h"
typedef union {
  struct {
    uint8_t FLUSH:1;
    uint8_t START:1;
    uint8_t :6;
  } bit;
  uint8_t reg;
} ADC_SWTRIG_Type;
# 291 "include/component/adc.h"
typedef union {
  struct {
    uint32_t MUXPOS:5;
    uint32_t :3;
    uint32_t MUXNEG:5;
    uint32_t :3;
    uint32_t INPUTSCAN:4;
    uint32_t INPUTOFFSET:4;
    uint32_t GAIN:4;
    uint32_t :4;
  } bit;
  uint32_t reg;
} ADC_INPUTCTRL_Type;
# 410 "include/component/adc.h"
typedef union {
  struct {
    uint8_t STARTEI:1;
    uint8_t SYNCEI:1;
    uint8_t :2;
    uint8_t RESRDYEO:1;
    uint8_t WINMONEO:1;
    uint8_t :2;
  } bit;
  uint8_t reg;
} ADC_EVCTRL_Type;
# 438 "include/component/adc.h"
typedef union {
  struct {
    uint8_t RESRDY:1;
    uint8_t OVERRUN:1;
    uint8_t WINMON:1;
    uint8_t SYNCRDY:1;
    uint8_t :4;
  } bit;
  uint8_t reg;
} ADC_INTENCLR_Type;
# 465 "include/component/adc.h"
typedef union {
  struct {
    uint8_t RESRDY:1;
    uint8_t OVERRUN:1;
    uint8_t WINMON:1;
    uint8_t SYNCRDY:1;
    uint8_t :4;
  } bit;
  uint8_t reg;
} ADC_INTENSET_Type;
# 492 "include/component/adc.h"
typedef union {
  struct {
    volatile const uint8_t RESRDY:1;
    volatile const uint8_t OVERRUN:1;
    volatile const uint8_t WINMON:1;
    volatile const uint8_t SYNCRDY:1;
    volatile const uint8_t :4;
  } bit;
  uint8_t reg;
} ADC_INTFLAG_Type;
# 519 "include/component/adc.h"
typedef union {
  struct {
    uint8_t :7;
    uint8_t SYNCBUSY:1;
  } bit;
  uint8_t reg;
} ADC_STATUS_Type;
# 537 "include/component/adc.h"
typedef union {
  struct {
    uint16_t RESULT:16;
  } bit;
  uint16_t reg;
} ADC_RESULT_Type;
# 555 "include/component/adc.h"
typedef union {
  struct {
    uint16_t WINLT:16;
  } bit;
  uint16_t reg;
} ADC_WINLT_Type;
