twitchyliquid64/samd10_boilerplate/compiled_samd10d13a.h
# 573 "include/component/adc.h"
typedef union {
  struct {
    uint16_t WINUT:16;
  } bit;
  uint16_t reg;
} ADC_WINUT_Type;
# 591 "include/component/adc.h"
typedef union {
  struct {
    uint16_t GAINCORR:12;
    uint16_t :4;
  } bit;
  uint16_t reg;
} ADC_GAINCORR_Type;
# 610 "include/component/adc.h"
typedef union {
  struct {
    uint16_t OFFSETCORR:12;
    uint16_t :4;
  } bit;
  uint16_t reg;
} ADC_OFFSETCORR_Type;
# 629 "include/component/adc.h"
typedef union {
  struct {
    uint16_t LINEARITY_CAL:8;
    uint16_t BIAS_CAL:3;
    uint16_t :5;
  } bit;
  uint16_t reg;
} ADC_CALIB_Type;
# 652 "include/component/adc.h"
typedef union {
  struct {
    uint8_t DBGRUN:1;
    uint8_t :7;
  } bit;
  uint8_t reg;
} ADC_DBGCTRL_Type;
# 670 "include/component/adc.h"
typedef struct {
  volatile ADC_CTRLA_Type CTRLA;
  volatile ADC_REFCTRL_Type REFCTRL;
  volatile ADC_AVGCTRL_Type AVGCTRL;
  volatile ADC_SAMPCTRL_Type SAMPCTRL;
  volatile ADC_CTRLB_Type CTRLB;
       RoReg8 Reserved1[0x2];
  volatile ADC_WINCTRL_Type WINCTRL;
       RoReg8 Reserved2[0x3];
  volatile ADC_SWTRIG_Type SWTRIG;
       RoReg8 Reserved3[0x3];
  volatile ADC_INPUTCTRL_Type INPUTCTRL;
  volatile ADC_EVCTRL_Type EVCTRL;
       RoReg8 Reserved4[0x1];
  volatile ADC_INTENCLR_Type INTENCLR;
  volatile ADC_INTENSET_Type INTENSET;
  volatile ADC_INTFLAG_Type INTFLAG;
  volatile const ADC_STATUS_Type STATUS;
  volatile const ADC_RESULT_Type RESULT;
  volatile ADC_WINLT_Type WINLT;
       RoReg8 Reserved5[0x2];
  volatile ADC_WINUT_Type WINUT;
       RoReg8 Reserved6[0x2];
  volatile ADC_GAINCORR_Type GAINCORR;
  volatile ADC_OFFSETCORR_Type OFFSETCORR;
  volatile ADC_CALIB_Type CALIB;
  volatile ADC_DBGCTRL_Type DBGCTRL;
} Adc;
# 227 "include/samd10c13a.h" 2
# 1 "include/component/dac.h" 1
# 61 "include/component/dac.h"
typedef union {
  struct {
    uint8_t SWRST:1;
    uint8_t ENABLE:1;
    uint8_t RUNSTDBY:1;
    uint8_t :5;
  } bit;
  uint8_t reg;
} DAC_CTRLA_Type;
# 85 "include/component/dac.h"
typedef union {
  struct {
    uint8_t EOEN:1;
    uint8_t IOEN:1;
    uint8_t LEFTADJ:1;
    uint8_t VPD:1;
    uint8_t BDWP:1;
    uint8_t :1;
    uint8_t REFSEL:2;
  } bit;
  uint8_t reg;
} DAC_CTRLB_Type;
# 125 "include/component/dac.h"
typedef union {
  struct {
    uint8_t STARTEI:1;
    uint8_t EMPTYEO:1;
    uint8_t :6;
  } bit;
  uint8_t reg;
} DAC_EVCTRL_Type;
# 146 "include/component/dac.h"
typedef union {
  struct {
    uint8_t UNDERRUN:1;
    uint8_t EMPTY:1;
    uint8_t SYNCRDY:1;
    uint8_t :5;
  } bit;
  uint8_t reg;
} DAC_INTENCLR_Type;
# 170 "include/component/dac.h"
typedef union {
  struct {
    uint8_t UNDERRUN:1;
    uint8_t EMPTY:1;
    uint8_t SYNCRDY:1;
    uint8_t :5;
  } bit;
  uint8_t reg;
} DAC_INTENSET_Type;
# 194 "include/component/dac.h"
typedef union {
  struct {
    volatile const uint8_t UNDERRUN:1;
    volatile const uint8_t EMPTY:1;
    volatile const uint8_t SYNCRDY:1;
    volatile const uint8_t :5;
  } bit;
  uint8_t reg;
} DAC_INTFLAG_Type;
# 218 "include/component/dac.h"
typedef union {
  struct {
    uint8_t :7;
    uint8_t SYNCBUSY:1;
  } bit;
  uint8_t reg;
} DAC_STATUS_Type;
# 236 "include/component/dac.h"
typedef union {
  struct {
    uint16_t DATA:16;
  } bit;
  uint16_t reg;
} DAC_DATA_Type;
# 254 "include/component/dac.h"
typedef union {
  struct {
    uint16_t DATABUF:16;
  } bit;
  uint16_t reg;
} DAC_DATABUF_Type;
# 272 "include/component/dac.h"
typedef struct {
  volatile DAC_CTRLA_Type CTRLA;
  volatile DAC_CTRLB_Type CTRLB;
  volatile DAC_EVCTRL_Type EVCTRL;
       RoReg8 Reserved1[0x1];
  volatile DAC_INTENCLR_Type INTENCLR;
  volatile DAC_INTENSET_Type INTENSET;
  volatile DAC_INTFLAG_Type INTFLAG;
  volatile const DAC_STATUS_Type STATUS;
  volatile DAC_DATA_Type DATA;
       RoReg8 Reserved2[0x2];
  volatile DAC_DATABUF_Type DATABUF;
} Dac;
# 228 "include/samd10c13a.h" 2
# 1 "include/component/dmac.h" 1
# 61 "include/component/dmac.h"
typedef union {
  struct {
    uint16_t SWRST:1;
    uint16_t DMAENABLE:1;
    uint16_t CRCENABLE:1;
    uint16_t :5;
    uint16_t LVLEN0:1;
    uint16_t LVLEN1:1;
    uint16_t LVLEN2:1;
    uint16_t LVLEN3:1;
    uint16_t :4;
  } bit;
  struct {
    uint16_t :8;
    uint16_t LVLEN:4;
    uint16_t :4;
  } vec;
  uint16_t reg;
} DMAC_CTRL_Type;
# 106 "include/component/dmac.h"
typedef union {
  struct {
    uint16_t CRCBEATSIZE:2;
    uint16_t CRCPOLY:2;
    uint16_t :4;
    uint16_t CRCSRC:6;
    uint16_t :2;
  } bit;
  uint16_t reg;
} DMAC_CRCCTRL_Type;
# 148 "include/component/dmac.h"
typedef union {
  struct {
    uint32_t CRCDATAIN:32;
  } bit;
  uint32_t reg;
} DMAC_CRCDATAIN_Type;
# 166 "include/component/dmac.h"
typedef union {
  struct {
    uint32_t CRCCHKSUM:32;
  } bit;
  uint32_t reg;
} DMAC_CRCCHKSUM_Type;
# 184 "include/component/dmac.h"
typedef union {
  struct {
    uint8_t CRCBUSY:1;
    uint8_t CRCZERO:1;
    uint8_t :6;
  } bit;
  uint8_t reg;
} DMAC_CRCSTATUS_Type;
# 205 "include/component/dmac.h"
typedef union {
  struct {
    uint8_t DBGRUN:1;
    uint8_t :7;
  } bit;
  uint8_t reg;
} DMAC_DBGCTRL_Type;
# 223 "include/component/dmac.h"
typedef union {
  struct {
    uint8_t WRBQOS:2;
    uint8_t FQOS:2;
    uint8_t DQOS:2;
    uint8_t :2;
  } bit;
  uint8_t reg;
} DMAC_QOSCTRL_Type;
# 274 "include/component/dmac.h"
typedef union {
  struct {
    uint32_t SWTRIG0:1;
    uint32_t SWTRIG1:1;
    uint32_t SWTRIG2:1;
    uint32_t SWTRIG3:1;
    uint32_t SWTRIG4:1;
    uint32_t SWTRIG5:1;
    uint32_t :26;
  } bit;
  struct {
    uint32_t SWTRIG:6;
    uint32_t :26;
  } vec;
  uint32_t reg;
} DMAC_SWTRIGCTRL_Type;
# 314 "include/component/dmac.h"
typedef union {
  struct {
    uint32_t LVLPRI0:3;
    uint32_t :4;
    uint32_t RRLVLEN0:1;
    uint32_t LVLPRI1:3;
    uint32_t :4;
    uint32_t RRLVLEN1:1;
    uint32_t LVLPRI2:3;
    uint32_t :4;
    uint32_t RRLVLEN2:1;
    uint32_t LVLPRI3:3;
    uint32_t :4;
    uint32_t RRLVLEN3:1;
  } bit;
  uint32_t reg;
} DMAC_PRICTRL0_Type;
# 360 "include/component/dmac.h"
typedef union {
  struct {
    uint16_t ID:3;
    uint16_t :5;
    uint16_t TERR:1;
    uint16_t TCMPL:1;
    uint16_t SUSP:1;
    uint16_t :2;
    uint16_t FERR:1;
    uint16_t BUSY:1;
    uint16_t PEND:1;
  } bit;
  uint16_t reg;
} DMAC_INTPEND_Type;
