twitchyliquid64/samd10_boilerplate/compiled_samd10d13a.h
# 398 "include/component/dmac.h"
typedef union {
  struct {
    uint32_t CHINT0:1;
    uint32_t CHINT1:1;
    uint32_t CHINT2:1;
    uint32_t CHINT3:1;
    uint32_t CHINT4:1;
    uint32_t CHINT5:1;
    uint32_t :26;
  } bit;
  struct {
    uint32_t CHINT:6;
    uint32_t :26;
  } vec;
  uint32_t reg;
} DMAC_INTSTATUS_Type;
# 438 "include/component/dmac.h"
typedef union {
  struct {
    uint32_t BUSYCH0:1;
    uint32_t BUSYCH1:1;
    uint32_t BUSYCH2:1;
    uint32_t BUSYCH3:1;
    uint32_t BUSYCH4:1;
    uint32_t BUSYCH5:1;
    uint32_t :26;
  } bit;
  struct {
    uint32_t BUSYCH:6;
    uint32_t :26;
  } vec;
  uint32_t reg;
} DMAC_BUSYCH_Type;
# 478 "include/component/dmac.h"
typedef union {
  struct {
    uint32_t PENDCH0:1;
    uint32_t PENDCH1:1;
    uint32_t PENDCH2:1;
    uint32_t PENDCH3:1;
    uint32_t PENDCH4:1;
    uint32_t PENDCH5:1;
    uint32_t :26;
  } bit;
  struct {
    uint32_t PENDCH:6;
    uint32_t :26;
  } vec;
  uint32_t reg;
} DMAC_PENDCH_Type;
# 518 "include/component/dmac.h"
typedef union {
  struct {
    uint32_t LVLEX0:1;
    uint32_t LVLEX1:1;
    uint32_t LVLEX2:1;
    uint32_t LVLEX3:1;
    uint32_t :4;
    uint32_t ID:5;
    uint32_t :2;
    uint32_t ABUSY:1;
    uint32_t BTCNT:16;
  } bit;
  struct {
    uint32_t LVLEX:4;
    uint32_t :28;
  } vec;
  uint32_t reg;
} DMAC_ACTIVE_Type;
# 564 "include/component/dmac.h"
typedef union {
  struct {
    uint32_t BASEADDR:32;
  } bit;
  uint32_t reg;
} DMAC_BASEADDR_Type;
# 582 "include/component/dmac.h"
typedef union {
  struct {
    uint32_t WRBADDR:32;
  } bit;
  uint32_t reg;
} DMAC_WRBADDR_Type;
# 600 "include/component/dmac.h"
typedef union {
  struct {
    uint8_t ID:3;
    uint8_t :5;
  } bit;
  uint8_t reg;
} DMAC_CHID_Type;
# 619 "include/component/dmac.h"
typedef union {
  struct {
    uint8_t SWRST:1;
    uint8_t ENABLE:1;
    uint8_t :6;
  } bit;
  uint8_t reg;
} DMAC_CHCTRLA_Type;
# 640 "include/component/dmac.h"
typedef union {
  struct {
    uint32_t EVACT:3;
    uint32_t EVIE:1;
    uint32_t EVOE:1;
    uint32_t LVL:2;
    uint32_t :1;
    uint32_t TRIGSRC:5;
    uint32_t :9;
    uint32_t TRIGACT:2;
    uint32_t CMD:2;
    uint32_t :6;
  } bit;
  uint32_t reg;
} DMAC_CHCTRLB_Type;
# 711 "include/component/dmac.h"
typedef union {
  struct {
    uint8_t TERR:1;
    uint8_t TCMPL:1;
    uint8_t SUSP:1;
    uint8_t :5;
  } bit;
  uint8_t reg;
} DMAC_CHINTENCLR_Type;
# 735 "include/component/dmac.h"
typedef union {
  struct {
    uint8_t TERR:1;
    uint8_t TCMPL:1;
    uint8_t SUSP:1;
    uint8_t :5;
  } bit;
  uint8_t reg;
} DMAC_CHINTENSET_Type;
# 759 "include/component/dmac.h"
typedef union {
  struct {
    volatile const uint8_t TERR:1;
    volatile const uint8_t TCMPL:1;
    volatile const uint8_t SUSP:1;
    volatile const uint8_t :5;
  } bit;
  uint8_t reg;
} DMAC_CHINTFLAG_Type;
# 783 "include/component/dmac.h"
typedef union {
  struct {
    uint8_t PEND:1;
    uint8_t BUSY:1;
    uint8_t FERR:1;
    uint8_t :5;
  } bit;
  uint8_t reg;
} DMAC_CHSTATUS_Type;
# 807 "include/component/dmac.h"
typedef union {
  struct {
    uint16_t VALID:1;
    uint16_t EVOSEL:2;
    uint16_t BLOCKACT:2;
    uint16_t :3;
    uint16_t BEATSIZE:2;
    uint16_t SRCINC:1;
    uint16_t DSTINC:1;
    uint16_t STEPSEL:1;
    uint16_t STEPSIZE:3;
  } bit;
  uint16_t reg;
} DMAC_BTCTRL_Type;
# 889 "include/component/dmac.h"
typedef union {
  struct {
    uint16_t BTCNT:16;
  } bit;
  uint16_t reg;
} DMAC_BTCNT_Type;
# 906 "include/component/dmac.h"
typedef union {
  struct {
    uint32_t SRCADDR:32;
  } bit;
  uint32_t reg;
} DMAC_SRCADDR_Type;
# 923 "include/component/dmac.h"
typedef union {
  struct {
    uint32_t DSTADDR:32;
  } bit;
  uint32_t reg;
} DMAC_DSTADDR_Type;
# 940 "include/component/dmac.h"
typedef union {
  struct {
    uint32_t DESCADDR:32;
  } bit;
  uint32_t reg;
} DMAC_DESCADDR_Type;
# 957 "include/component/dmac.h"
typedef struct {
  volatile DMAC_CTRL_Type CTRL;
  volatile DMAC_CRCCTRL_Type CRCCTRL;
  volatile DMAC_CRCDATAIN_Type CRCDATAIN;
  volatile DMAC_CRCCHKSUM_Type CRCCHKSUM;
  volatile DMAC_CRCSTATUS_Type CRCSTATUS;
  volatile DMAC_DBGCTRL_Type DBGCTRL;
  volatile DMAC_QOSCTRL_Type QOSCTRL;
       RoReg8 Reserved1[0x1];
  volatile DMAC_SWTRIGCTRL_Type SWTRIGCTRL;
  volatile DMAC_PRICTRL0_Type PRICTRL0;
       RoReg8 Reserved2[0x8];
  volatile DMAC_INTPEND_Type INTPEND;
       RoReg8 Reserved3[0x2];
  volatile const DMAC_INTSTATUS_Type INTSTATUS;
  volatile const DMAC_BUSYCH_Type BUSYCH;
  volatile const DMAC_PENDCH_Type PENDCH;
  volatile const DMAC_ACTIVE_Type ACTIVE;
  volatile DMAC_BASEADDR_Type BASEADDR;
  volatile DMAC_WRBADDR_Type WRBADDR;
       RoReg8 Reserved4[0x3];
  volatile DMAC_CHID_Type CHID;
  volatile DMAC_CHCTRLA_Type CHCTRLA;
       RoReg8 Reserved5[0x3];
  volatile DMAC_CHCTRLB_Type CHCTRLB;
       RoReg8 Reserved6[0x4];
  volatile DMAC_CHINTENCLR_Type CHINTENCLR;
  volatile DMAC_CHINTENSET_Type CHINTENSET;
  volatile DMAC_CHINTFLAG_Type CHINTFLAG;
  volatile const DMAC_CHSTATUS_Type CHSTATUS;
} Dmac;




typedef struct {
  volatile DMAC_BTCTRL_Type BTCTRL;
  volatile DMAC_BTCNT_Type BTCNT;
  volatile DMAC_SRCADDR_Type SRCADDR;
  volatile DMAC_DSTADDR_Type DSTADDR;
  volatile DMAC_DESCADDR_Type DESCADDR;
} DmacDescriptor

  __attribute__ ((aligned (8)))

;
# 229 "include/samd10c13a.h" 2
# 1 "include/component/dsu.h" 1
# 61 "include/component/dsu.h"
typedef union {
  struct {
    uint8_t SWRST:1;
    uint8_t :1;
    uint8_t CRC:1;
    uint8_t MBIST:1;
    uint8_t CE:1;
    uint8_t :1;
    uint8_t ARR:1;
    uint8_t SMSA:1;
  } bit;
  uint8_t reg;
} DSU_CTRL_Type;
# 95 "include/component/dsu.h"
typedef union {
  struct {
    uint8_t DONE:1;
    uint8_t CRSTEXT:1;
    uint8_t BERR:1;
    uint8_t FAIL:1;
    uint8_t PERR:1;
    uint8_t :3;
  } bit;
  uint8_t reg;
} DSU_STATUSA_Type;
# 125 "include/component/dsu.h"
typedef union {
  struct {
    uint8_t PROT:1;
    uint8_t DBGPRES:1;
    uint8_t DCCD0:1;
    uint8_t DCCD1:1;
    uint8_t HPE:1;
    uint8_t :3;
  } bit;
  struct {
    uint8_t :2;
    uint8_t DCCD:2;
    uint8_t :4;
  } vec;
  uint8_t reg;
} DSU_STATUSB_Type;
# 163 "include/component/dsu.h"
typedef union {
  struct {
    uint32_t AMOD:2;
    uint32_t ADDR:30;
  } bit;
  uint32_t reg;
} DSU_ADDR_Type;
# 185 "include/component/dsu.h"
typedef union {
  struct {
    uint32_t :2;
    uint32_t LENGTH:30;
  } bit;
  uint32_t reg;
} DSU_LENGTH_Type;
# 204 "include/component/dsu.h"
typedef union {
  struct {
    uint32_t DATA:32;
  } bit;
  uint32_t reg;
} DSU_DATA_Type;
# 222 "include/component/dsu.h"
typedef union {
  struct {
    uint32_t DATA:32;
  } bit;
  uint32_t reg;
} DSU_DCC_Type;
# 240 "include/component/dsu.h"
typedef union {
  struct {
    uint32_t DEVSEL:8;
    uint32_t REVISION:4;
    uint32_t DIE:4;
    uint32_t SERIES:6;
    uint32_t :1;
    uint32_t FAMILY:5;
    uint32_t PROCESSOR:4;
  } bit;
  uint32_t reg;
} DSU_DID_Type;
# 294 "include/component/dsu.h"
typedef union {
  struct {
    uint32_t DCFG:32;
  } bit;
  uint32_t reg;
} DSU_DCFG_Type;
