twitchyliquid64/samd10_boilerplate/compiled_samd10d13a.h
# 312 "include/component/dsu.h"
typedef union {
  struct {
    uint32_t EPRES:1;
    uint32_t FMT:1;
    uint32_t :10;
    uint32_t ADDOFF:20;
  } bit;
  uint32_t reg;
} DSU_ENTRY_Type;
# 336 "include/component/dsu.h"
typedef union {
  struct {
    uint32_t END:32;
  } bit;
  uint32_t reg;
} DSU_END_Type;
# 354 "include/component/dsu.h"
typedef union {
  struct {
    uint32_t SMEMP:1;
    uint32_t :31;
  } bit;
  uint32_t reg;
} DSU_MEMTYPE_Type;
# 372 "include/component/dsu.h"
typedef union {
  struct {
    uint32_t JEPCC:4;
    uint32_t FKBC:4;
    uint32_t :24;
  } bit;
  uint32_t reg;
} DSU_PID4_Type;
# 395 "include/component/dsu.h"
typedef union {
  uint32_t reg;
} DSU_PID5_Type;







typedef union {
  uint32_t reg;
} DSU_PID6_Type;







typedef union {
  uint32_t reg;
} DSU_PID7_Type;







typedef union {
  struct {
    uint32_t PARTNBL:8;
    uint32_t :24;
  } bit;
  uint32_t reg;
} DSU_PID0_Type;
# 444 "include/component/dsu.h"
typedef union {
  struct {
    uint32_t PARTNBH:4;
    uint32_t JEPIDCL:4;
    uint32_t :24;
  } bit;
  uint32_t reg;
} DSU_PID1_Type;
# 467 "include/component/dsu.h"
typedef union {
  struct {
    uint32_t JEPIDCH:3;
    uint32_t JEPU:1;
    uint32_t REVISION:4;
    uint32_t :24;
  } bit;
  uint32_t reg;
} DSU_PID2_Type;
# 493 "include/component/dsu.h"
typedef union {
  struct {
    uint32_t CUSMOD:4;
    uint32_t REVAND:4;
    uint32_t :24;
  } bit;
  uint32_t reg;
} DSU_PID3_Type;
# 516 "include/component/dsu.h"
typedef union {
  struct {
    uint32_t PREAMBLEB0:8;
    uint32_t :24;
  } bit;
  uint32_t reg;
} DSU_CID0_Type;
# 535 "include/component/dsu.h"
typedef union {
  struct {
    uint32_t PREAMBLE:4;
    uint32_t CCLASS:4;
    uint32_t :24;
  } bit;
  uint32_t reg;
} DSU_CID1_Type;
# 558 "include/component/dsu.h"
typedef union {
  struct {
    uint32_t PREAMBLEB2:8;
    uint32_t :24;
  } bit;
  uint32_t reg;
} DSU_CID2_Type;
# 577 "include/component/dsu.h"
typedef union {
  struct {
    uint32_t PREAMBLEB3:8;
    uint32_t :24;
  } bit;
  uint32_t reg;
} DSU_CID3_Type;
# 596 "include/component/dsu.h"
typedef struct {
  volatile DSU_CTRL_Type CTRL;
  volatile DSU_STATUSA_Type STATUSA;
  volatile const DSU_STATUSB_Type STATUSB;
       RoReg8 Reserved1[0x1];
  volatile DSU_ADDR_Type ADDR;
  volatile DSU_LENGTH_Type LENGTH;
  volatile DSU_DATA_Type DATA;
  volatile DSU_DCC_Type DCC[2];
  volatile const DSU_DID_Type DID;
       RoReg8 Reserved2[0xD4];
  volatile DSU_DCFG_Type DCFG[2];
       RoReg8 Reserved3[0xF08];
  volatile const DSU_ENTRY_Type ENTRY[2];
  volatile const DSU_END_Type END;
       RoReg8 Reserved4[0xFC0];
  volatile const DSU_MEMTYPE_Type MEMTYPE;
  volatile const DSU_PID4_Type PID4;
  volatile const DSU_PID5_Type PID5;
  volatile const DSU_PID6_Type PID6;
  volatile const DSU_PID7_Type PID7;
  volatile const DSU_PID0_Type PID0;
  volatile const DSU_PID1_Type PID1;
  volatile const DSU_PID2_Type PID2;
  volatile const DSU_PID3_Type PID3;
  volatile const DSU_CID0_Type CID0;
  volatile const DSU_CID1_Type CID1;
  volatile const DSU_CID2_Type CID2;
  volatile const DSU_CID3_Type CID3;
} Dsu;
# 230 "include/samd10c13a.h" 2
# 1 "include/component/eic.h" 1
# 61 "include/component/eic.h"
typedef union {
  struct {
    uint8_t SWRST:1;
    uint8_t ENABLE:1;
    uint8_t :6;
  } bit;
  uint8_t reg;
} EIC_CTRL_Type;
# 82 "include/component/eic.h"
typedef union {
  struct {
    uint8_t :7;
    uint8_t SYNCBUSY:1;
  } bit;
  uint8_t reg;
} EIC_STATUS_Type;
# 100 "include/component/eic.h"
typedef union {
  struct {
    uint8_t NMISENSE:3;
    uint8_t NMIFILTEN:1;
    uint8_t :4;
  } bit;
  uint8_t reg;
} EIC_NMICTRL_Type;
# 134 "include/component/eic.h"
typedef union {
  struct {
    uint8_t NMI:1;
    uint8_t :7;
  } bit;
  uint8_t reg;
} EIC_NMIFLAG_Type;
# 152 "include/component/eic.h"
typedef union {
  struct {
    uint32_t EXTINTEO0:1;
    uint32_t EXTINTEO1:1;
    uint32_t EXTINTEO2:1;
    uint32_t EXTINTEO3:1;
    uint32_t EXTINTEO4:1;
    uint32_t EXTINTEO5:1;
    uint32_t EXTINTEO6:1;
    uint32_t EXTINTEO7:1;
    uint32_t :24;
  } bit;
  struct {
    uint32_t EXTINTEO:8;
    uint32_t :24;
  } vec;
  uint32_t reg;
} EIC_EVCTRL_Type;
# 198 "include/component/eic.h"
typedef union {
  struct {
    uint32_t EXTINT0:1;
    uint32_t EXTINT1:1;
    uint32_t EXTINT2:1;
    uint32_t EXTINT3:1;
    uint32_t EXTINT4:1;
    uint32_t EXTINT5:1;
    uint32_t EXTINT6:1;
    uint32_t EXTINT7:1;
    uint32_t :24;
  } bit;
  struct {
    uint32_t EXTINT:8;
    uint32_t :24;
  } vec;
  uint32_t reg;
} EIC_INTENCLR_Type;
# 244 "include/component/eic.h"
typedef union {
  struct {
    uint32_t EXTINT0:1;
    uint32_t EXTINT1:1;
    uint32_t EXTINT2:1;
    uint32_t EXTINT3:1;
    uint32_t EXTINT4:1;
    uint32_t EXTINT5:1;
    uint32_t EXTINT6:1;
    uint32_t EXTINT7:1;
    uint32_t :24;
  } bit;
  struct {
    uint32_t EXTINT:8;
    uint32_t :24;
  } vec;
  uint32_t reg;
} EIC_INTENSET_Type;
# 290 "include/component/eic.h"
typedef union {
  struct {
    volatile const uint32_t EXTINT0:1;
    volatile const uint32_t EXTINT1:1;
    volatile const uint32_t EXTINT2:1;
    volatile const uint32_t EXTINT3:1;
    volatile const uint32_t EXTINT4:1;
    volatile const uint32_t EXTINT5:1;
    volatile const uint32_t EXTINT6:1;
    volatile const uint32_t EXTINT7:1;
    volatile const uint32_t :24;
  } bit;
  struct {
    volatile const uint32_t EXTINT:8;
    volatile const uint32_t :24;
  } vec;
  uint32_t reg;
} EIC_INTFLAG_Type;
# 336 "include/component/eic.h"
typedef union {
  struct {
    uint32_t WAKEUPEN0:1;
    uint32_t WAKEUPEN1:1;
    uint32_t WAKEUPEN2:1;
    uint32_t WAKEUPEN3:1;
    uint32_t WAKEUPEN4:1;
    uint32_t WAKEUPEN5:1;
    uint32_t WAKEUPEN6:1;
    uint32_t WAKEUPEN7:1;
    uint32_t :24;
  } bit;
  struct {
    uint32_t WAKEUPEN:8;
    uint32_t :24;
  } vec;
  uint32_t reg;
} EIC_WAKEUP_Type;
# 382 "include/component/eic.h"
typedef union {
  struct {
    uint32_t SENSE0:3;
    uint32_t FILTEN0:1;
    uint32_t SENSE1:3;
    uint32_t FILTEN1:1;
    uint32_t SENSE2:3;
    uint32_t FILTEN2:1;
    uint32_t SENSE3:3;
    uint32_t FILTEN3:1;
    uint32_t SENSE4:3;
    uint32_t FILTEN4:1;
    uint32_t SENSE5:3;
    uint32_t FILTEN5:1;
    uint32_t SENSE6:3;
    uint32_t FILTEN6:1;
    uint32_t SENSE7:3;
    uint32_t FILTEN7:1;
  } bit;
  uint32_t reg;
} EIC_CONFIG_Type;
# 548 "include/component/eic.h"
typedef struct {
  volatile EIC_CTRL_Type CTRL;
  volatile const EIC_STATUS_Type STATUS;
  volatile EIC_NMICTRL_Type NMICTRL;
  volatile EIC_NMIFLAG_Type NMIFLAG;
  volatile EIC_EVCTRL_Type EVCTRL;
  volatile EIC_INTENCLR_Type INTENCLR;
  volatile EIC_INTENSET_Type INTENSET;
  volatile EIC_INTFLAG_Type INTFLAG;
  volatile EIC_WAKEUP_Type WAKEUP;
  volatile EIC_CONFIG_Type CONFIG[1];
} Eic;
