twitchyliquid64/samd10_boilerplate/compiled_samd10d13a.h
# 231 "include/samd10c13a.h" 2
# 1 "include/component/evsys.h" 1
# 61 "include/component/evsys.h"
typedef union {
  struct {
    uint8_t SWRST:1;
    uint8_t :3;
    uint8_t GCLKREQ:1;
    uint8_t :3;
  } bit;
  uint8_t reg;
} EVSYS_CTRL_Type;
# 83 "include/component/evsys.h"
typedef union {
  struct {
    uint32_t CHANNEL:3;
    uint32_t :5;
    uint32_t SWEVT:1;
    uint32_t :7;
    uint32_t EVGEN:6;
    uint32_t :2;
    uint32_t PATH:2;
    uint32_t EDGSEL:2;
    uint32_t :4;
  } bit;
  uint32_t reg;
} EVSYS_CHANNEL_Type;
# 134 "include/component/evsys.h"
typedef union {
  struct {
    uint16_t USER:5;
    uint16_t :3;
    uint16_t CHANNEL:4;
    uint16_t :4;
  } bit;
  uint16_t reg;
} EVSYS_USER_Type;
# 160 "include/component/evsys.h"
typedef union {
  struct {
    uint32_t USRRDY0:1;
    uint32_t USRRDY1:1;
    uint32_t USRRDY2:1;
    uint32_t USRRDY3:1;
    uint32_t USRRDY4:1;
    uint32_t USRRDY5:1;
    uint32_t :2;
    uint32_t CHBUSY0:1;
    uint32_t CHBUSY1:1;
    uint32_t CHBUSY2:1;
    uint32_t CHBUSY3:1;
    uint32_t CHBUSY4:1;
    uint32_t CHBUSY5:1;
    uint32_t :18;
  } bit;
  struct {
    uint32_t USRRDY:6;
    uint32_t :2;
    uint32_t CHBUSY:6;
    uint32_t :18;
  } vec;
  uint32_t reg;
} EVSYS_CHSTATUS_Type;
# 224 "include/component/evsys.h"
typedef union {
  struct {
    uint32_t OVR0:1;
    uint32_t OVR1:1;
    uint32_t OVR2:1;
    uint32_t OVR3:1;
    uint32_t OVR4:1;
    uint32_t OVR5:1;
    uint32_t :2;
    uint32_t EVD0:1;
    uint32_t EVD1:1;
    uint32_t EVD2:1;
    uint32_t EVD3:1;
    uint32_t EVD4:1;
    uint32_t EVD5:1;
    uint32_t :18;
  } bit;
  struct {
    uint32_t OVR:6;
    uint32_t :2;
    uint32_t EVD:6;
    uint32_t :18;
  } vec;
  uint32_t reg;
} EVSYS_INTENCLR_Type;
# 288 "include/component/evsys.h"
typedef union {
  struct {
    uint32_t OVR0:1;
    uint32_t OVR1:1;
    uint32_t OVR2:1;
    uint32_t OVR3:1;
    uint32_t OVR4:1;
    uint32_t OVR5:1;
    uint32_t :2;
    uint32_t EVD0:1;
    uint32_t EVD1:1;
    uint32_t EVD2:1;
    uint32_t EVD3:1;
    uint32_t EVD4:1;
    uint32_t EVD5:1;
    uint32_t :18;
  } bit;
  struct {
    uint32_t OVR:6;
    uint32_t :2;
    uint32_t EVD:6;
    uint32_t :18;
  } vec;
  uint32_t reg;
} EVSYS_INTENSET_Type;
# 352 "include/component/evsys.h"
typedef union {
  struct {
    volatile const uint32_t OVR0:1;
    volatile const uint32_t OVR1:1;
    volatile const uint32_t OVR2:1;
    volatile const uint32_t OVR3:1;
    volatile const uint32_t OVR4:1;
    volatile const uint32_t OVR5:1;
    volatile const uint32_t :2;
    volatile const uint32_t EVD0:1;
    volatile const uint32_t EVD1:1;
    volatile const uint32_t EVD2:1;
    volatile const uint32_t EVD3:1;
    volatile const uint32_t EVD4:1;
    volatile const uint32_t EVD5:1;
    volatile const uint32_t :18;
  } bit;
  struct {
    volatile const uint32_t OVR:6;
    volatile const uint32_t :2;
    volatile const uint32_t EVD:6;
    volatile const uint32_t :18;
  } vec;
  uint32_t reg;
} EVSYS_INTFLAG_Type;
# 416 "include/component/evsys.h"
typedef struct {
  volatile EVSYS_CTRL_Type CTRL;
       RoReg8 Reserved1[0x3];
  volatile EVSYS_CHANNEL_Type CHANNEL;
  volatile EVSYS_USER_Type USER;
       RoReg8 Reserved2[0x2];
  volatile const EVSYS_CHSTATUS_Type CHSTATUS;
  volatile EVSYS_INTENCLR_Type INTENCLR;
  volatile EVSYS_INTENSET_Type INTENSET;
  volatile EVSYS_INTFLAG_Type INTFLAG;
} Evsys;
# 232 "include/samd10c13a.h" 2
# 1 "include/component/gclk.h" 1
# 61 "include/component/gclk.h"
typedef union {
  struct {
    uint8_t SWRST:1;
    uint8_t :7;
  } bit;
  uint8_t reg;
} GCLK_CTRL_Type;
# 79 "include/component/gclk.h"
typedef union {
  struct {
    uint8_t :7;
    uint8_t SYNCBUSY:1;
  } bit;
  uint8_t reg;
} GCLK_STATUS_Type;
# 97 "include/component/gclk.h"
typedef union {
  struct {
    uint16_t ID:6;
    uint16_t :2;
    uint16_t GEN:4;
    uint16_t :2;
    uint16_t CLKEN:1;
    uint16_t WRTLOCK:1;
  } bit;
  uint16_t reg;
} GCLK_CLKCTRL_Type;
# 191 "include/component/gclk.h"
typedef union {
  struct {
    uint32_t ID:4;
    uint32_t :4;
    uint32_t SRC:5;
    uint32_t :3;
    uint32_t GENEN:1;
    uint32_t IDC:1;
    uint32_t OOV:1;
    uint32_t OE:1;
    uint32_t DIVSEL:1;
    uint32_t RUNSTDBY:1;
    uint32_t :10;
  } bit;
  uint32_t reg;
} GCLK_GENCTRL_Type;
# 252 "include/component/gclk.h"
typedef union {
  struct {
    uint32_t ID:4;
    uint32_t :4;
    uint32_t DIV:16;
    uint32_t :8;
  } bit;
  uint32_t reg;
} GCLK_GENDIV_Type;
# 276 "include/component/gclk.h"
typedef struct {
  volatile GCLK_CTRL_Type CTRL;
  volatile const GCLK_STATUS_Type STATUS;
  volatile GCLK_CLKCTRL_Type CLKCTRL;
  volatile GCLK_GENCTRL_Type GENCTRL;
  volatile GCLK_GENDIV_Type GENDIV;
} Gclk;
# 233 "include/samd10c13a.h" 2
# 1 "include/component/hmatrixb.h" 1
# 61 "include/component/hmatrixb.h"
typedef union {
  struct {
    uint32_t M0PR:4;
    uint32_t M1PR:4;
    uint32_t M2PR:4;
    uint32_t M3PR:4;
    uint32_t M4PR:4;
    uint32_t M5PR:4;
    uint32_t M6PR:4;
    uint32_t M7PR:4;
  } bit;
  uint32_t reg;
} HMATRIXB_PRAS_Type;
# 107 "include/component/hmatrixb.h"
typedef union {
  struct {
    uint32_t M8PR:4;
    uint32_t M9PR:4;
    uint32_t M10PR:4;
    uint32_t M11PR:4;
    uint32_t M12PR:4;
    uint32_t M13PR:4;
    uint32_t M14PR:4;
    uint32_t M15PR:4;
  } bit;
  uint32_t reg;
} HMATRIXB_PRBS_Type;
# 153 "include/component/hmatrixb.h"
typedef union {
  struct {
    uint32_t SFR:32;
  } bit;
  uint32_t reg;
} HMATRIXB_SFR_Type;
# 171 "include/component/hmatrixb.h"
typedef struct {
  volatile HMATRIXB_PRAS_Type PRAS;
  volatile HMATRIXB_PRBS_Type PRBS;
} HmatrixbPrs;




typedef struct {
       RoReg8 Reserved1[0x80];
       HmatrixbPrs Prs[16];
       RoReg8 Reserved2[0x10];
  volatile HMATRIXB_SFR_Type SFR[16];
} Hmatrixb;
# 234 "include/samd10c13a.h" 2
# 1 "include/component/mtb.h" 1
# 61 "include/component/mtb.h"
typedef union {
  struct {
    uint32_t :2;
    uint32_t WRAP:1;
    uint32_t POINTER:29;
  } bit;
  uint32_t reg;
} MTB_POSITION_Type;
# 82 "include/component/mtb.h"
typedef union {
  struct {
    uint32_t MASK:5;
    uint32_t TSTARTEN:1;
    uint32_t TSTOPEN:1;
    uint32_t SFRWPRIV:1;
    uint32_t RAMPRIV:1;
    uint32_t HALTREQ:1;
    uint32_t :21;
    uint32_t EN:1;
  } bit;
  uint32_t reg;
} MTB_MASTER_Type;
# 119 "include/component/mtb.h"
typedef union {
  struct {
    uint32_t AUTOSTOP:1;
    uint32_t AUTOHALT:1;
    uint32_t :1;
    uint32_t WATERMARK:29;
  } bit;
  uint32_t reg;
} MTB_FLOW_Type;
