twitchyliquid64/samd10_boilerplate/compiled_samd10d13a.h
# 144 "include/component/mtb.h"
typedef union {
  uint32_t reg;
} MTB_BASE_Type;







typedef union {
  uint32_t reg;
} MTB_ITCTRL_Type;







typedef union {
  uint32_t reg;
} MTB_CLAIMSET_Type;







typedef union {
  uint32_t reg;
} MTB_CLAIMCLR_Type;







typedef union {
  uint32_t reg;
} MTB_LOCKACCESS_Type;







typedef union {
  uint32_t reg;
} MTB_LOCKSTATUS_Type;







typedef union {
  uint32_t reg;
} MTB_AUTHSTATUS_Type;







typedef union {
  uint32_t reg;
} MTB_DEVARCH_Type;







typedef union {
  uint32_t reg;
} MTB_DEVID_Type;







typedef union {
  uint32_t reg;
} MTB_DEVTYPE_Type;







typedef union {
  uint32_t reg;
} MTB_PID4_Type;







typedef union {
  uint32_t reg;
} MTB_PID5_Type;







typedef union {
  uint32_t reg;
} MTB_PID6_Type;







typedef union {
  uint32_t reg;
} MTB_PID7_Type;







typedef union {
  uint32_t reg;
} MTB_PID0_Type;







typedef union {
  uint32_t reg;
} MTB_PID1_Type;







typedef union {
  uint32_t reg;
} MTB_PID2_Type;







typedef union {
  uint32_t reg;
} MTB_PID3_Type;







typedef union {
  uint32_t reg;
} MTB_CID0_Type;







typedef union {
  uint32_t reg;
} MTB_CID1_Type;







typedef union {
  uint32_t reg;
} MTB_CID2_Type;







typedef union {
  uint32_t reg;
} MTB_CID3_Type;







typedef struct {
  volatile MTB_POSITION_Type POSITION;
  volatile MTB_MASTER_Type MASTER;
  volatile MTB_FLOW_Type FLOW;
  volatile const MTB_BASE_Type BASE;
       RoReg8 Reserved1[0xEF0];
  volatile MTB_ITCTRL_Type ITCTRL;
       RoReg8 Reserved2[0x9C];
  volatile MTB_CLAIMSET_Type CLAIMSET;
  volatile MTB_CLAIMCLR_Type CLAIMCLR;
       RoReg8 Reserved3[0x8];
  volatile MTB_LOCKACCESS_Type LOCKACCESS;
  volatile const MTB_LOCKSTATUS_Type LOCKSTATUS;
  volatile const MTB_AUTHSTATUS_Type AUTHSTATUS;
  volatile const MTB_DEVARCH_Type DEVARCH;
       RoReg8 Reserved4[0x8];
  volatile const MTB_DEVID_Type DEVID;
  volatile const MTB_DEVTYPE_Type DEVTYPE;
  volatile const MTB_PID4_Type PID4;
  volatile const MTB_PID5_Type PID5;
  volatile const MTB_PID6_Type PID6;
  volatile const MTB_PID7_Type PID7;
  volatile const MTB_PID0_Type PID0;
  volatile const MTB_PID1_Type PID1;
  volatile const MTB_PID2_Type PID2;
  volatile const MTB_PID3_Type PID3;
  volatile const MTB_CID0_Type CID0;
  volatile const MTB_CID1_Type CID1;
  volatile const MTB_CID2_Type CID2;
  volatile const MTB_CID3_Type CID3;
} Mtb;
# 235 "include/samd10c13a.h" 2
# 1 "include/component/nvmctrl.h" 1
# 61 "include/component/nvmctrl.h"
typedef union {
  struct {
    uint16_t CMD:7;
    uint16_t :1;
    uint16_t CMDEX:8;
  } bit;
  uint16_t reg;
} NVMCTRL_CTRLA_Type;
# 112 "include/component/nvmctrl.h"
typedef union {
  struct {
    uint32_t :1;
    uint32_t RWS:4;
    uint32_t :2;
    uint32_t MANW:1;
    uint32_t SLEEPPRM:2;
    uint32_t :6;
    uint32_t READMODE:2;
    uint32_t CACHEDIS:1;
    uint32_t :13;
  } bit;
  uint32_t reg;
} NVMCTRL_CTRLB_Type;
# 166 "include/component/nvmctrl.h"
typedef union {
  struct {
    uint32_t NVMP:16;
    uint32_t PSZ:3;
    uint32_t :13;
  } bit;
  uint32_t reg;
} NVMCTRL_PARAM_Type;
# 205 "include/component/nvmctrl.h"
typedef union {
  struct {
    uint8_t READY:1;
    uint8_t ERROR:1;
    uint8_t :6;
  } bit;
  uint8_t reg;
} NVMCTRL_INTENCLR_Type;
# 226 "include/component/nvmctrl.h"
typedef union {
  struct {
    uint8_t READY:1;
    uint8_t ERROR:1;
    uint8_t :6;
  } bit;
  uint8_t reg;
} NVMCTRL_INTENSET_Type;
# 247 "include/component/nvmctrl.h"
typedef union {
  struct {
    volatile const uint8_t READY:1;
    volatile const uint8_t ERROR:1;
    volatile const uint8_t :6;
  } bit;
  uint8_t reg;
} NVMCTRL_INTFLAG_Type;
# 268 "include/component/nvmctrl.h"
typedef union {
  struct {
    uint16_t PRM:1;
    uint16_t LOAD:1;
    uint16_t PROGE:1;
    uint16_t LOCKE:1;
    uint16_t NVME:1;
    uint16_t :3;
    uint16_t SB:1;
    uint16_t :7;
  } bit;
  uint16_t reg;
} NVMCTRL_STATUS_Type;
# 302 "include/component/nvmctrl.h"
typedef union {
  struct {
    uint32_t ADDR:22;
    uint32_t :10;
  } bit;
  uint32_t reg;
} NVMCTRL_ADDR_Type;
# 321 "include/component/nvmctrl.h"
typedef union {
  struct {
    uint16_t LOCK:16;
  } bit;
  uint16_t reg;
} NVMCTRL_LOCK_Type;
# 338 "include/component/nvmctrl.h"
typedef struct {
  volatile NVMCTRL_CTRLA_Type CTRLA;
       RoReg8 Reserved1[0x2];
  volatile NVMCTRL_CTRLB_Type CTRLB;
  volatile NVMCTRL_PARAM_Type PARAM;
  volatile NVMCTRL_INTENCLR_Type INTENCLR;
       RoReg8 Reserved2[0x3];
  volatile NVMCTRL_INTENSET_Type INTENSET;
       RoReg8 Reserved3[0x3];
  volatile NVMCTRL_INTFLAG_Type INTFLAG;
       RoReg8 Reserved4[0x3];
  volatile NVMCTRL_STATUS_Type STATUS;
       RoReg8 Reserved5[0x2];
  volatile NVMCTRL_ADDR_Type ADDR;
  volatile NVMCTRL_LOCK_Type LOCK;
} Nvmctrl;
# 236 "include/samd10c13a.h" 2
# 1 "include/component/pac.h" 1
# 61 "include/component/pac.h"
typedef union {
  struct {
    uint32_t :1;
    uint32_t WP:31;
  } bit;
  uint32_t reg;
} PAC_WPCLR_Type;
# 80 "include/component/pac.h"
typedef union {
  struct {
    uint32_t :1;
    uint32_t WP:31;
  } bit;
  uint32_t reg;
} PAC_WPSET_Type;
# 99 "include/component/pac.h"
typedef struct {
  volatile PAC_WPCLR_Type WPCLR;
  volatile PAC_WPSET_Type WPSET;
} Pac;
# 237 "include/samd10c13a.h" 2
# 1 "include/component/pm.h" 1
# 61 "include/component/pm.h"
typedef union {
  struct {
    uint8_t :2;
    uint8_t CFDEN:1;
    uint8_t :1;
    uint8_t BKUPCLK:1;
    uint8_t :3;
  } bit;
  uint8_t reg;
} PM_CTRL_Type;
# 84 "include/component/pm.h"
typedef union {
  struct {
    uint8_t IDLE:2;
    uint8_t :6;
  } bit;
  uint8_t reg;
} PM_SLEEP_Type;
# 109 "include/component/pm.h"
typedef union {
  struct {
    uint8_t SETDIS:1;
    uint8_t :7;
  } bit;
  uint8_t reg;
} PM_EXTCTRL_Type;
# 127 "include/component/pm.h"
typedef union {
  struct {
    uint8_t CPUDIV:3;
    uint8_t :5;
  } bit;
  uint8_t reg;
} PM_CPUSEL_Type;
# 162 "include/component/pm.h"
typedef union {
  struct {
    uint8_t APBADIV:3;
    uint8_t :5;
  } bit;
  uint8_t reg;
} PM_APBASEL_Type;
# 197 "include/component/pm.h"
typedef union {
  struct {
    uint8_t APBBDIV:3;
    uint8_t :5;
  } bit;
  uint8_t reg;
} PM_APBBSEL_Type;
# 232 "include/component/pm.h"
typedef union {
  struct {
    uint8_t APBCDIV:3;
    uint8_t :5;
  } bit;
  uint8_t reg;
} PM_APBCSEL_Type;
# 267 "include/component/pm.h"
typedef union {
  struct {
    uint32_t HPB0_:1;
    uint32_t HPB1_:1;
    uint32_t HPB2_:1;
    uint32_t DSU_:1;
    uint32_t NVMCTRL_:1;
    uint32_t DMAC_:1;
    uint32_t :26;
  } bit;
  uint32_t reg;
} PM_AHBMASK_Type;
# 300 "include/component/pm.h"
typedef union {
  struct {
    uint32_t PAC0_:1;
    uint32_t PM_:1;
    uint32_t SYSCTRL_:1;
    uint32_t GCLK_:1;
    uint32_t WDT_:1;
    uint32_t RTC_:1;
    uint32_t EIC_:1;
    uint32_t :25;
  } bit;
  uint32_t reg;
} PM_APBAMASK_Type;
