twitchyliquid64/samd10_boilerplate/compiled_samd10d13a.h
# 336 "include/component/pm.h"
typedef union {
  struct {
    uint32_t PAC1_:1;
    uint32_t DSU_:1;
    uint32_t NVMCTRL_:1;
    uint32_t PORT_:1;
    uint32_t DMAC_:1;
    uint32_t :1;
    uint32_t HMATRIX_:1;
    uint32_t :25;
  } bit;
  uint32_t reg;
} PM_APBBMASK_Type;
# 370 "include/component/pm.h"
typedef union {
  struct {
    uint32_t PAC2_:1;
    uint32_t EVSYS_:1;
    uint32_t SERCOM0_:1;
    uint32_t SERCOM1_:1;
    uint32_t SERCOM2_:1;
    uint32_t TCC0_:1;
    uint32_t TC1_:1;
    uint32_t TC2_:1;
    uint32_t ADC_:1;
    uint32_t AC_:1;
    uint32_t DAC_:1;
    uint32_t PTC_:1;
    uint32_t :20;
  } bit;
  uint32_t reg;
} PM_APBCMASK_Type;
# 421 "include/component/pm.h"
typedef union {
  struct {
    uint8_t CKRDY:1;
    uint8_t CFD:1;
    uint8_t :6;
  } bit;
  uint8_t reg;
} PM_INTENCLR_Type;
# 442 "include/component/pm.h"
typedef union {
  struct {
    uint8_t CKRDY:1;
    uint8_t CFD:1;
    uint8_t :6;
  } bit;
  uint8_t reg;
} PM_INTENSET_Type;
# 463 "include/component/pm.h"
typedef union {
  struct {
    volatile const uint8_t CKRDY:1;
    volatile const uint8_t CFD:1;
    volatile const uint8_t :6;
  } bit;
  uint8_t reg;
} PM_INTFLAG_Type;
# 484 "include/component/pm.h"
typedef union {
  struct {
    uint8_t POR:1;
    uint8_t BOD12:1;
    uint8_t BOD33:1;
    uint8_t :1;
    uint8_t EXT:1;
    uint8_t WDT:1;
    uint8_t SYST:1;
    uint8_t :1;
  } bit;
  uint8_t reg;
} PM_RCAUSE_Type;
# 518 "include/component/pm.h"
typedef struct {
  volatile PM_CTRL_Type CTRL;
  volatile PM_SLEEP_Type SLEEP;
  volatile PM_EXTCTRL_Type EXTCTRL;
       RoReg8 Reserved1[0x5];
  volatile PM_CPUSEL_Type CPUSEL;
  volatile PM_APBASEL_Type APBASEL;
  volatile PM_APBBSEL_Type APBBSEL;
  volatile PM_APBCSEL_Type APBCSEL;
       RoReg8 Reserved2[0x8];
  volatile PM_AHBMASK_Type AHBMASK;
  volatile PM_APBAMASK_Type APBAMASK;
  volatile PM_APBBMASK_Type APBBMASK;
  volatile PM_APBCMASK_Type APBCMASK;
       RoReg8 Reserved3[0x10];
  volatile PM_INTENCLR_Type INTENCLR;
  volatile PM_INTENSET_Type INTENSET;
  volatile PM_INTFLAG_Type INTFLAG;
       RoReg8 Reserved4[0x1];
  volatile const PM_RCAUSE_Type RCAUSE;
} Pm;
# 238 "include/samd10c13a.h" 2
# 1 "include/component/port.h" 1
# 61 "include/component/port.h"
typedef union {
  struct {
    uint32_t DIR:32;
  } bit;
  uint32_t reg;
} PORT_DIR_Type;
# 79 "include/component/port.h"
typedef union {
  struct {
    uint32_t DIRCLR:32;
  } bit;
  uint32_t reg;
} PORT_DIRCLR_Type;
# 97 "include/component/port.h"
typedef union {
  struct {
    uint32_t DIRSET:32;
  } bit;
  uint32_t reg;
} PORT_DIRSET_Type;
# 115 "include/component/port.h"
typedef union {
  struct {
    uint32_t DIRTGL:32;
  } bit;
  uint32_t reg;
} PORT_DIRTGL_Type;
# 133 "include/component/port.h"
typedef union {
  struct {
    uint32_t OUT:32;
  } bit;
  uint32_t reg;
} PORT_OUT_Type;
# 151 "include/component/port.h"
typedef union {
  struct {
    uint32_t OUTCLR:32;
  } bit;
  uint32_t reg;
} PORT_OUTCLR_Type;
# 169 "include/component/port.h"
typedef union {
  struct {
    uint32_t OUTSET:32;
  } bit;
  uint32_t reg;
} PORT_OUTSET_Type;
# 187 "include/component/port.h"
typedef union {
  struct {
    uint32_t OUTTGL:32;
  } bit;
  uint32_t reg;
} PORT_OUTTGL_Type;
# 205 "include/component/port.h"
typedef union {
  struct {
    uint32_t IN:32;
  } bit;
  uint32_t reg;
} PORT_IN_Type;
# 223 "include/component/port.h"
typedef union {
  struct {
    uint32_t SAMPLING:32;
  } bit;
  uint32_t reg;
} PORT_CTRL_Type;
# 241 "include/component/port.h"
typedef union {
  struct {
    uint32_t PINMASK:16;
    uint32_t PMUXEN:1;
    uint32_t INEN:1;
    uint32_t PULLEN:1;
    uint32_t :3;
    uint32_t DRVSTR:1;
    uint32_t :1;
    uint32_t PMUX:4;
    uint32_t WRPMUX:1;
    uint32_t :1;
    uint32_t WRPINCFG:1;
    uint32_t HWSEL:1;
  } bit;
  uint32_t reg;
} PORT_WRCONFIG_Type;
# 287 "include/component/port.h"
typedef union {
  struct {
    uint8_t PMUXE:4;
    uint8_t PMUXO:4;
  } bit;
  uint8_t reg;
} PORT_PMUX_Type;
# 341 "include/component/port.h"
typedef union {
  struct {
    uint8_t PMUXEN:1;
    uint8_t INEN:1;
    uint8_t PULLEN:1;
    uint8_t :3;
    uint8_t DRVSTR:1;
    uint8_t :1;
  } bit;
  uint8_t reg;
} PORT_PINCFG_Type;
# 369 "include/component/port.h"
typedef struct {
  volatile PORT_DIR_Type DIR;
  volatile PORT_DIRCLR_Type DIRCLR;
  volatile PORT_DIRSET_Type DIRSET;
  volatile PORT_DIRTGL_Type DIRTGL;
  volatile PORT_OUT_Type OUT;
  volatile PORT_OUTCLR_Type OUTCLR;
  volatile PORT_OUTSET_Type OUTSET;
  volatile PORT_OUTTGL_Type OUTTGL;
  volatile const PORT_IN_Type IN;
  volatile PORT_CTRL_Type CTRL;
  volatile PORT_WRCONFIG_Type WRCONFIG;
       RoReg8 Reserved1[0x4];
  volatile PORT_PMUX_Type PMUX[16];
  volatile PORT_PINCFG_Type PINCFG[32];
       RoReg8 Reserved2[0x20];
} PortGroup;




typedef struct {
       PortGroup Group[1];
} Port;
# 239 "include/samd10c13a.h" 2
# 1 "include/component/rtc.h" 1
# 61 "include/component/rtc.h"
typedef union {
  struct {
    uint16_t SWRST:1;
    uint16_t ENABLE:1;
    uint16_t MODE:2;
    uint16_t :3;
    uint16_t MATCHCLR:1;
    uint16_t PRESCALER:4;
    uint16_t :4;
  } bit;
  uint16_t reg;
} RTC_MODE0_CTRL_Type;
# 122 "include/component/rtc.h"
typedef union {
  struct {
    uint16_t SWRST:1;
    uint16_t ENABLE:1;
    uint16_t MODE:2;
    uint16_t :4;
    uint16_t PRESCALER:4;
    uint16_t :4;
  } bit;
  uint16_t reg;
} RTC_MODE1_CTRL_Type;
# 180 "include/component/rtc.h"
typedef union {
  struct {
    uint16_t SWRST:1;
    uint16_t ENABLE:1;
    uint16_t MODE:2;
    uint16_t :2;
    uint16_t CLKREP:1;
    uint16_t MATCHCLR:1;
    uint16_t PRESCALER:4;
    uint16_t :4;
  } bit;
  uint16_t reg;
} RTC_MODE2_CTRL_Type;
# 244 "include/component/rtc.h"
typedef union {
  struct {
    uint16_t ADDR:6;
    uint16_t :8;
    uint16_t RCONT:1;
    uint16_t RREQ:1;
  } bit;
  uint16_t reg;
} RTC_READREQ_Type;
# 269 "include/component/rtc.h"
typedef union {
  struct {
    uint16_t PEREO0:1;
    uint16_t PEREO1:1;
    uint16_t PEREO2:1;
    uint16_t PEREO3:1;
    uint16_t PEREO4:1;
    uint16_t PEREO5:1;
    uint16_t PEREO6:1;
    uint16_t PEREO7:1;
    uint16_t CMPEO0:1;
    uint16_t :6;
    uint16_t OVFEO:1;
  } bit;
  struct {
    uint16_t PEREO:8;
    uint16_t CMPEO:1;
    uint16_t :7;
  } vec;
  uint16_t reg;
} RTC_MODE0_EVCTRL_Type;
