twitchyliquid64/samd10_boilerplate/compiled_samd10d13a.h
# 325 "include/component/rtc.h"
typedef union {
  struct {
    uint16_t PEREO0:1;
    uint16_t PEREO1:1;
    uint16_t PEREO2:1;
    uint16_t PEREO3:1;
    uint16_t PEREO4:1;
    uint16_t PEREO5:1;
    uint16_t PEREO6:1;
    uint16_t PEREO7:1;
    uint16_t CMPEO0:1;
    uint16_t CMPEO1:1;
    uint16_t :5;
    uint16_t OVFEO:1;
  } bit;
  struct {
    uint16_t PEREO:8;
    uint16_t CMPEO:2;
    uint16_t :6;
  } vec;
  uint16_t reg;
} RTC_MODE1_EVCTRL_Type;
# 384 "include/component/rtc.h"
typedef union {
  struct {
    uint16_t PEREO0:1;
    uint16_t PEREO1:1;
    uint16_t PEREO2:1;
    uint16_t PEREO3:1;
    uint16_t PEREO4:1;
    uint16_t PEREO5:1;
    uint16_t PEREO6:1;
    uint16_t PEREO7:1;
    uint16_t ALARMEO0:1;
    uint16_t :6;
    uint16_t OVFEO:1;
  } bit;
  struct {
    uint16_t PEREO:8;
    uint16_t ALARMEO:1;
    uint16_t :7;
  } vec;
  uint16_t reg;
} RTC_MODE2_EVCTRL_Type;
# 440 "include/component/rtc.h"
typedef union {
  struct {
    uint8_t CMP0:1;
    uint8_t :5;
    uint8_t SYNCRDY:1;
    uint8_t OVF:1;
  } bit;
  struct {
    uint8_t CMP:1;
    uint8_t :7;
  } vec;
  uint8_t reg;
} RTC_MODE0_INTENCLR_Type;
# 471 "include/component/rtc.h"
typedef union {
  struct {
    uint8_t CMP0:1;
    uint8_t CMP1:1;
    uint8_t :4;
    uint8_t SYNCRDY:1;
    uint8_t OVF:1;
  } bit;
  struct {
    uint8_t CMP:2;
    uint8_t :6;
  } vec;
  uint8_t reg;
} RTC_MODE1_INTENCLR_Type;
# 505 "include/component/rtc.h"
typedef union {
  struct {
    uint8_t ALARM0:1;
    uint8_t :5;
    uint8_t SYNCRDY:1;
    uint8_t OVF:1;
  } bit;
  struct {
    uint8_t ALARM:1;
    uint8_t :7;
  } vec;
  uint8_t reg;
} RTC_MODE2_INTENCLR_Type;
# 536 "include/component/rtc.h"
typedef union {
  struct {
    uint8_t CMP0:1;
    uint8_t :5;
    uint8_t SYNCRDY:1;
    uint8_t OVF:1;
  } bit;
  struct {
    uint8_t CMP:1;
    uint8_t :7;
  } vec;
  uint8_t reg;
} RTC_MODE0_INTENSET_Type;
# 567 "include/component/rtc.h"
typedef union {
  struct {
    uint8_t CMP0:1;
    uint8_t CMP1:1;
    uint8_t :4;
    uint8_t SYNCRDY:1;
    uint8_t OVF:1;
  } bit;
  struct {
    uint8_t CMP:2;
    uint8_t :6;
  } vec;
  uint8_t reg;
} RTC_MODE1_INTENSET_Type;
# 601 "include/component/rtc.h"
typedef union {
  struct {
    uint8_t ALARM0:1;
    uint8_t :5;
    uint8_t SYNCRDY:1;
    uint8_t OVF:1;
  } bit;
  struct {
    uint8_t ALARM:1;
    uint8_t :7;
  } vec;
  uint8_t reg;
} RTC_MODE2_INTENSET_Type;
# 632 "include/component/rtc.h"
typedef union {
  struct {
    volatile const uint8_t CMP0:1;
    volatile const uint8_t :5;
    volatile const uint8_t SYNCRDY:1;
    volatile const uint8_t OVF:1;
  } bit;
  struct {
    volatile const uint8_t CMP:1;
    volatile const uint8_t :7;
  } vec;
  uint8_t reg;
} RTC_MODE0_INTFLAG_Type;
# 663 "include/component/rtc.h"
typedef union {
  struct {
    volatile const uint8_t CMP0:1;
    volatile const uint8_t CMP1:1;
    volatile const uint8_t :4;
    volatile const uint8_t SYNCRDY:1;
    volatile const uint8_t OVF:1;
  } bit;
  struct {
    volatile const uint8_t CMP:2;
    volatile const uint8_t :6;
  } vec;
  uint8_t reg;
} RTC_MODE1_INTFLAG_Type;
# 697 "include/component/rtc.h"
typedef union {
  struct {
    volatile const uint8_t ALARM0:1;
    volatile const uint8_t :5;
    volatile const uint8_t SYNCRDY:1;
    volatile const uint8_t OVF:1;
  } bit;
  struct {
    volatile const uint8_t ALARM:1;
    volatile const uint8_t :7;
  } vec;
  uint8_t reg;
} RTC_MODE2_INTFLAG_Type;
# 728 "include/component/rtc.h"
typedef union {
  struct {
    uint8_t :7;
    uint8_t SYNCBUSY:1;
  } bit;
  uint8_t reg;
} RTC_STATUS_Type;
# 746 "include/component/rtc.h"
typedef union {
  struct {
    uint8_t DBGRUN:1;
    uint8_t :7;
  } bit;
  uint8_t reg;
} RTC_DBGCTRL_Type;
# 764 "include/component/rtc.h"
typedef union {
  struct {
    uint8_t VALUE:7;
    uint8_t SIGN:1;
  } bit;
  uint8_t reg;
} RTC_FREQCORR_Type;
# 785 "include/component/rtc.h"
typedef union {
  struct {
    uint32_t COUNT:32;
  } bit;
  uint32_t reg;
} RTC_MODE0_COUNT_Type;
# 803 "include/component/rtc.h"
typedef union {
  struct {
    uint16_t COUNT:16;
  } bit;
  uint16_t reg;
} RTC_MODE1_COUNT_Type;
# 821 "include/component/rtc.h"
typedef union {
  struct {
    uint32_t SECOND:6;
    uint32_t MINUTE:6;
    uint32_t HOUR:5;
    uint32_t DAY:5;
    uint32_t MONTH:4;
    uint32_t YEAR:6;
  } bit;
  uint32_t reg;
} RTC_MODE2_CLOCK_Type;
# 861 "include/component/rtc.h"
typedef union {
  struct {
    uint16_t PER:16;
  } bit;
  uint16_t reg;
} RTC_MODE1_PER_Type;
# 879 "include/component/rtc.h"
typedef union {
  struct {
    uint32_t COMP:32;
  } bit;
  uint32_t reg;
} RTC_MODE0_COMP_Type;
# 897 "include/component/rtc.h"
typedef union {
  struct {
    uint16_t COMP:16;
  } bit;
  uint16_t reg;
} RTC_MODE1_COMP_Type;
# 915 "include/component/rtc.h"
typedef union {
  struct {
    uint32_t SECOND:6;
    uint32_t MINUTE:6;
    uint32_t HOUR:5;
    uint32_t DAY:5;
    uint32_t MONTH:4;
    uint32_t YEAR:6;
  } bit;
  uint32_t reg;
} RTC_MODE2_ALARM_Type;
# 953 "include/component/rtc.h"
typedef union {
  struct {
    uint8_t SEL:3;
    uint8_t :5;
  } bit;
  uint8_t reg;
} RTC_MODE2_MASK_Type;
# 986 "include/component/rtc.h"
typedef struct {
  volatile RTC_MODE2_ALARM_Type ALARM;
  volatile RTC_MODE2_MASK_Type MASK;
       RoReg8 Reserved1[0x3];
} RtcMode2Alarm;




typedef struct {
  volatile RTC_MODE0_CTRL_Type CTRL;
  volatile RTC_READREQ_Type READREQ;
  volatile RTC_MODE0_EVCTRL_Type EVCTRL;
  volatile RTC_MODE0_INTENCLR_Type INTENCLR;
  volatile RTC_MODE0_INTENSET_Type INTENSET;
  volatile RTC_MODE0_INTFLAG_Type INTFLAG;
       RoReg8 Reserved1[0x1];
  volatile RTC_STATUS_Type STATUS;
  volatile RTC_DBGCTRL_Type DBGCTRL;
  volatile RTC_FREQCORR_Type FREQCORR;
       RoReg8 Reserved2[0x3];
  volatile RTC_MODE0_COUNT_Type COUNT;
       RoReg8 Reserved3[0x4];
  volatile RTC_MODE0_COMP_Type COMP[1];
} RtcMode0;




typedef struct {
  volatile RTC_MODE1_CTRL_Type CTRL;
  volatile RTC_READREQ_Type READREQ;
  volatile RTC_MODE1_EVCTRL_Type EVCTRL;
  volatile RTC_MODE1_INTENCLR_Type INTENCLR;
  volatile RTC_MODE1_INTENSET_Type INTENSET;
  volatile RTC_MODE1_INTFLAG_Type INTFLAG;
       RoReg8 Reserved1[0x1];
  volatile RTC_STATUS_Type STATUS;
  volatile RTC_DBGCTRL_Type DBGCTRL;
  volatile RTC_FREQCORR_Type FREQCORR;
       RoReg8 Reserved2[0x3];
  volatile RTC_MODE1_COUNT_Type COUNT;
       RoReg8 Reserved3[0x2];
  volatile RTC_MODE1_PER_Type PER;
       RoReg8 Reserved4[0x2];
  volatile RTC_MODE1_COMP_Type COMP[2];
} RtcMode1;




