twitchyliquid64/samd10_boilerplate/compiled_samd10d13a.h
typedef struct {
  volatile RTC_MODE2_CTRL_Type CTRL;
  volatile RTC_READREQ_Type READREQ;
  volatile RTC_MODE2_EVCTRL_Type EVCTRL;
  volatile RTC_MODE2_INTENCLR_Type INTENCLR;
  volatile RTC_MODE2_INTENSET_Type INTENSET;
  volatile RTC_MODE2_INTFLAG_Type INTFLAG;
       RoReg8 Reserved1[0x1];
  volatile RTC_STATUS_Type STATUS;
  volatile RTC_DBGCTRL_Type DBGCTRL;
  volatile RTC_FREQCORR_Type FREQCORR;
       RoReg8 Reserved2[0x3];
  volatile RTC_MODE2_CLOCK_Type CLOCK;
       RoReg8 Reserved3[0x4];
       RtcMode2Alarm Mode2Alarm[1];
} RtcMode2;



typedef union {
       RtcMode0 MODE0;
       RtcMode1 MODE1;
       RtcMode2 MODE2;
} Rtc;
# 240 "include/samd10c13a.h" 2
# 1 "include/component/sercom.h" 1
# 61 "include/component/sercom.h"
typedef union {
  struct {
    uint32_t SWRST:1;
    uint32_t ENABLE:1;
    uint32_t MODE:3;
    uint32_t :2;
    uint32_t RUNSTDBY:1;
    uint32_t :8;
    uint32_t PINOUT:1;
    uint32_t :3;
    uint32_t SDAHOLD:2;
    uint32_t MEXTTOEN:1;
    uint32_t SEXTTOEN:1;
    uint32_t SPEED:2;
    uint32_t :1;
    uint32_t SCLSM:1;
    uint32_t INACTOUT:2;
    uint32_t LOWTOUTEN:1;
    uint32_t :1;
  } bit;
  uint32_t reg;
} SERCOM_I2CM_CTRLA_Type;
# 132 "include/component/sercom.h"
typedef union {
  struct {
    uint32_t SWRST:1;
    uint32_t ENABLE:1;
    uint32_t MODE:3;
    uint32_t :2;
    uint32_t RUNSTDBY:1;
    uint32_t :8;
    uint32_t PINOUT:1;
    uint32_t :3;
    uint32_t SDAHOLD:2;
    uint32_t :1;
    uint32_t SEXTTOEN:1;
    uint32_t SPEED:2;
    uint32_t :1;
    uint32_t SCLSM:1;
    uint32_t :2;
    uint32_t LOWTOUTEN:1;
    uint32_t :1;
  } bit;
  uint32_t reg;
} SERCOM_I2CS_CTRLA_Type;
# 198 "include/component/sercom.h"
typedef union {
  struct {
    uint32_t SWRST:1;
    uint32_t ENABLE:1;
    uint32_t MODE:3;
    uint32_t :2;
    uint32_t RUNSTDBY:1;
    uint32_t IBON:1;
    uint32_t :7;
    uint32_t DOPO:2;
    uint32_t :2;
    uint32_t DIPO:2;
    uint32_t :2;
    uint32_t FORM:4;
    uint32_t CPHA:1;
    uint32_t CPOL:1;
    uint32_t DORD:1;
    uint32_t :1;
  } bit;
  uint32_t reg;
} SERCOM_SPI_CTRLA_Type;
# 266 "include/component/sercom.h"
typedef union {
  struct {
    uint32_t SWRST:1;
    uint32_t ENABLE:1;
    uint32_t MODE:3;
    uint32_t :2;
    uint32_t RUNSTDBY:1;
    uint32_t IBON:1;
    uint32_t :4;
    uint32_t SAMPR:3;
    uint32_t TXPO:2;
    uint32_t :2;
    uint32_t RXPO:2;
    uint32_t SAMPA:2;
    uint32_t FORM:4;
    uint32_t CMODE:1;
    uint32_t CPOL:1;
    uint32_t DORD:1;
    uint32_t :1;
  } bit;
  uint32_t reg;
} SERCOM_USART_CTRLA_Type;
# 341 "include/component/sercom.h"
typedef union {
  struct {
    uint32_t :8;
    uint32_t SMEN:1;
    uint32_t QCEN:1;
    uint32_t :6;
    uint32_t CMD:2;
    uint32_t ACKACT:1;
    uint32_t :13;
  } bit;
  uint32_t reg;
} SERCOM_I2CM_CTRLB_Type;
# 371 "include/component/sercom.h"
typedef union {
  struct {
    uint32_t :8;
    uint32_t SMEN:1;
    uint32_t GCMD:1;
    uint32_t AACKEN:1;
    uint32_t :3;
    uint32_t AMODE:2;
    uint32_t CMD:2;
    uint32_t ACKACT:1;
    uint32_t :13;
  } bit;
  uint32_t reg;
} SERCOM_I2CS_CTRLB_Type;
# 408 "include/component/sercom.h"
typedef union {
  struct {
    uint32_t CHSIZE:3;
    uint32_t :3;
    uint32_t PLOADEN:1;
    uint32_t :2;
    uint32_t SSDE:1;
    uint32_t :3;
    uint32_t MSSEN:1;
    uint32_t AMODE:2;
    uint32_t :1;
    uint32_t RXEN:1;
    uint32_t :14;
  } bit;
  uint32_t reg;
} SERCOM_SPI_CTRLB_Type;
# 447 "include/component/sercom.h"
typedef union {
  struct {
    uint32_t CHSIZE:3;
    uint32_t :3;
    uint32_t SBMODE:1;
    uint32_t :1;
    uint32_t COLDEN:1;
    uint32_t SFDE:1;
    uint32_t ENC:1;
    uint32_t :2;
    uint32_t PMODE:1;
    uint32_t :2;
    uint32_t TXEN:1;
    uint32_t RXEN:1;
    uint32_t :14;
  } bit;
  uint32_t reg;
} SERCOM_USART_CTRLB_Type;
# 491 "include/component/sercom.h"
typedef union {
  struct {
    uint32_t BAUD:8;
    uint32_t BAUDLOW:8;
    uint32_t HSBAUD:8;
    uint32_t HSBAUDLOW:8;
  } bit;
  uint32_t reg;
} SERCOM_I2CM_BAUD_Type;
# 521 "include/component/sercom.h"
typedef union {
  struct {
    uint8_t BAUD:8;
  } bit;
  uint8_t reg;
} SERCOM_SPI_BAUD_Type;
# 539 "include/component/sercom.h"
typedef union {
  struct {
    uint16_t BAUD:16;
  } bit;
  struct {
    uint16_t BAUD:13;
    uint16_t FP:3;
  } FRAC;
  struct {
    uint16_t BAUD:13;
    uint16_t FP:3;
  } FRACFP;
  struct {
    uint16_t BAUD:16;
  } USARTFP;
  uint16_t reg;
} SERCOM_USART_BAUD_Type;
# 592 "include/component/sercom.h"
typedef union {
  struct {
    uint8_t RXPL:8;
  } bit;
  uint8_t reg;
} SERCOM_USART_RXPL_Type;
# 610 "include/component/sercom.h"
typedef union {
  struct {
    uint8_t MB:1;
    uint8_t SB:1;
    uint8_t :5;
    uint8_t ERROR:1;
  } bit;
  uint8_t reg;
} SERCOM_I2CM_INTENCLR_Type;
# 634 "include/component/sercom.h"
typedef union {
  struct {
    uint8_t PREC:1;
    uint8_t AMATCH:1;
    uint8_t DRDY:1;
    uint8_t :4;
    uint8_t ERROR:1;
  } bit;
  uint8_t reg;
} SERCOM_I2CS_INTENCLR_Type;
# 661 "include/component/sercom.h"
typedef union {
  struct {
    uint8_t DRE:1;
    uint8_t TXC:1;
    uint8_t RXC:1;
    uint8_t SSL:1;
    uint8_t :3;
    uint8_t ERROR:1;
  } bit;
  uint8_t reg;
} SERCOM_SPI_INTENCLR_Type;
# 691 "include/component/sercom.h"
typedef union {
  struct {
    uint8_t DRE:1;
    uint8_t TXC:1;
    uint8_t RXC:1;
    uint8_t RXS:1;
    uint8_t CTSIC:1;
    uint8_t RXBRK:1;
    uint8_t :1;
    uint8_t ERROR:1;
  } bit;
  uint8_t reg;
} SERCOM_USART_INTENCLR_Type;
# 727 "include/component/sercom.h"
typedef union {
  struct {
    uint8_t MB:1;
    uint8_t SB:1;
    uint8_t :5;
    uint8_t ERROR:1;
  } bit;
  uint8_t reg;
} SERCOM_I2CM_INTENSET_Type;
# 751 "include/component/sercom.h"
typedef union {
  struct {
    uint8_t PREC:1;
    uint8_t AMATCH:1;
    uint8_t DRDY:1;
    uint8_t :4;
    uint8_t ERROR:1;
  } bit;
  uint8_t reg;
} SERCOM_I2CS_INTENSET_Type;
# 778 "include/component/sercom.h"
typedef union {
  struct {
    uint8_t DRE:1;
    uint8_t TXC:1;
    uint8_t RXC:1;
    uint8_t SSL:1;
    uint8_t :3;
    uint8_t ERROR:1;
  } bit;
  uint8_t reg;
} SERCOM_SPI_INTENSET_Type;
# 808 "include/component/sercom.h"
typedef union {
  struct {
    uint8_t DRE:1;
    uint8_t TXC:1;
    uint8_t RXC:1;
    uint8_t RXS:1;
    uint8_t CTSIC:1;
    uint8_t RXBRK:1;
    uint8_t :1;
    uint8_t ERROR:1;
  } bit;
  uint8_t reg;
} SERCOM_USART_INTENSET_Type;
# 844 "include/component/sercom.h"
typedef union {
  struct {
    volatile const uint8_t MB:1;
    volatile const uint8_t SB:1;
    volatile const uint8_t :5;
    volatile const uint8_t ERROR:1;
  } bit;
  uint8_t reg;
} SERCOM_I2CM_INTFLAG_Type;
# 868 "include/component/sercom.h"
typedef union {
  struct {
    volatile const uint8_t PREC:1;
    volatile const uint8_t AMATCH:1;
    volatile const uint8_t DRDY:1;
    volatile const uint8_t :4;
    volatile const uint8_t ERROR:1;
  } bit;
  uint8_t reg;
} SERCOM_I2CS_INTFLAG_Type;
# 895 "include/component/sercom.h"
typedef union {
  struct {
    volatile const uint8_t DRE:1;
    volatile const uint8_t TXC:1;
    volatile const uint8_t RXC:1;
    volatile const uint8_t SSL:1;
    volatile const uint8_t :3;
    volatile const uint8_t ERROR:1;
  } bit;
  uint8_t reg;
} SERCOM_SPI_INTFLAG_Type;
# 925 "include/component/sercom.h"
typedef union {
  struct {
    volatile const uint8_t DRE:1;
    volatile const uint8_t TXC:1;
    volatile const uint8_t RXC:1;
    volatile const uint8_t RXS:1;
    volatile const uint8_t CTSIC:1;
    volatile const uint8_t RXBRK:1;
    volatile const uint8_t :1;
    volatile const uint8_t ERROR:1;
  } bit;
  uint8_t reg;
} SERCOM_USART_INTFLAG_Type;
# 961 "include/component/sercom.h"
typedef union {
  struct {
    uint16_t BUSERR:1;
    uint16_t ARBLOST:1;
    uint16_t RXNACK:1;
    uint16_t :1;
    uint16_t BUSSTATE:2;
    uint16_t LOWTOUT:1;
    uint16_t CLKHOLD:1;
    uint16_t MEXTTOUT:1;
    uint16_t SEXTTOUT:1;
    uint16_t LENERR:1;
    uint16_t :5;
  } bit;
  uint16_t reg;
} SERCOM_I2CM_STATUS_Type;
# 1005 "include/component/sercom.h"
typedef union {
  struct {
    uint16_t BUSERR:1;
    uint16_t COLL:1;
    uint16_t RXNACK:1;
    uint16_t DIR:1;
    uint16_t SR:1;
    uint16_t :1;
    uint16_t LOWTOUT:1;
    uint16_t CLKHOLD:1;
    uint16_t :1;
    uint16_t SEXTTOUT:1;
    uint16_t HS:1;
    uint16_t :5;
  } bit;
  uint16_t reg;
} SERCOM_I2CS_STATUS_Type;
# 1049 "include/component/sercom.h"
typedef union {
  struct {
    uint16_t :2;
    uint16_t BUFOVF:1;
    uint16_t :13;
  } bit;
  uint16_t reg;
} SERCOM_SPI_STATUS_Type;
