twitchyliquid64/samd10_boilerplate/compiled_samd10d13a.h
# 1068 "include/component/sercom.h"
typedef union {
  struct {
    uint16_t PERR:1;
    uint16_t FERR:1;
    uint16_t BUFOVF:1;
    uint16_t CTS:1;
    uint16_t ISF:1;
    uint16_t COLL:1;
    uint16_t :10;
  } bit;
  uint16_t reg;
} SERCOM_USART_STATUS_Type;
# 1101 "include/component/sercom.h"
typedef union {
  struct {
    uint32_t SWRST:1;
    uint32_t ENABLE:1;
    uint32_t SYSOP:1;
    uint32_t :29;
  } bit;
  uint32_t reg;
} SERCOM_I2CM_SYNCBUSY_Type;
# 1125 "include/component/sercom.h"
typedef union {
  struct {
    uint32_t SWRST:1;
    uint32_t ENABLE:1;
    uint32_t :30;
  } bit;
  uint32_t reg;
} SERCOM_I2CS_SYNCBUSY_Type;
# 1146 "include/component/sercom.h"
typedef union {
  struct {
    uint32_t SWRST:1;
    uint32_t ENABLE:1;
    uint32_t CTRLB:1;
    uint32_t :29;
  } bit;
  uint32_t reg;
} SERCOM_SPI_SYNCBUSY_Type;
# 1170 "include/component/sercom.h"
typedef union {
  struct {
    uint32_t SWRST:1;
    uint32_t ENABLE:1;
    uint32_t CTRLB:1;
    uint32_t :29;
  } bit;
  uint32_t reg;
} SERCOM_USART_SYNCBUSY_Type;
# 1194 "include/component/sercom.h"
typedef union {
  struct {
    uint32_t ADDR:11;
    uint32_t :2;
    uint32_t LENEN:1;
    uint32_t HS:1;
    uint32_t TENBITEN:1;
    uint32_t LEN:8;
    uint32_t :8;
  } bit;
  uint32_t reg;
} SERCOM_I2CM_ADDR_Type;
# 1227 "include/component/sercom.h"
typedef union {
  struct {
    uint32_t GENCEN:1;
    uint32_t ADDR:10;
    uint32_t :4;
    uint32_t TENBITEN:1;
    uint32_t :1;
    uint32_t ADDRMASK:10;
    uint32_t :5;
  } bit;
  uint32_t reg;
} SERCOM_I2CS_ADDR_Type;
# 1258 "include/component/sercom.h"
typedef union {
  struct {
    uint32_t ADDR:8;
    uint32_t :8;
    uint32_t ADDRMASK:8;
    uint32_t :8;
  } bit;
  uint32_t reg;
} SERCOM_SPI_ADDR_Type;
# 1282 "include/component/sercom.h"
typedef union {
  struct {
    uint8_t DATA:8;
  } bit;
  uint8_t reg;
} SERCOM_I2CM_DATA_Type;
# 1300 "include/component/sercom.h"
typedef union {
  struct {
    uint8_t DATA:8;
  } bit;
  uint8_t reg;
} SERCOM_I2CS_DATA_Type;
# 1318 "include/component/sercom.h"
typedef union {
  struct {
    uint32_t DATA:9;
    uint32_t :23;
  } bit;
  uint32_t reg;
} SERCOM_SPI_DATA_Type;
# 1337 "include/component/sercom.h"
typedef union {
  struct {
    uint16_t DATA:9;
    uint16_t :7;
  } bit;
  uint16_t reg;
} SERCOM_USART_DATA_Type;
# 1356 "include/component/sercom.h"
typedef union {
  struct {
    uint8_t DBGSTOP:1;
    uint8_t :7;
  } bit;
  uint8_t reg;
} SERCOM_I2CM_DBGCTRL_Type;
# 1374 "include/component/sercom.h"
typedef union {
  struct {
    uint8_t DBGSTOP:1;
    uint8_t :7;
  } bit;
  uint8_t reg;
} SERCOM_SPI_DBGCTRL_Type;
# 1392 "include/component/sercom.h"
typedef union {
  struct {
    uint8_t DBGSTOP:1;
    uint8_t :7;
  } bit;
  uint8_t reg;
} SERCOM_USART_DBGCTRL_Type;
# 1410 "include/component/sercom.h"
typedef struct {
  volatile SERCOM_I2CM_CTRLA_Type CTRLA;
  volatile SERCOM_I2CM_CTRLB_Type CTRLB;
       RoReg8 Reserved1[0x4];
  volatile SERCOM_I2CM_BAUD_Type BAUD;
       RoReg8 Reserved2[0x4];
  volatile SERCOM_I2CM_INTENCLR_Type INTENCLR;
       RoReg8 Reserved3[0x1];
  volatile SERCOM_I2CM_INTENSET_Type INTENSET;
       RoReg8 Reserved4[0x1];
  volatile SERCOM_I2CM_INTFLAG_Type INTFLAG;
       RoReg8 Reserved5[0x1];
  volatile SERCOM_I2CM_STATUS_Type STATUS;
  volatile const SERCOM_I2CM_SYNCBUSY_Type SYNCBUSY;
       RoReg8 Reserved6[0x4];
  volatile SERCOM_I2CM_ADDR_Type ADDR;
  volatile SERCOM_I2CM_DATA_Type DATA;
       RoReg8 Reserved7[0x7];
  volatile SERCOM_I2CM_DBGCTRL_Type DBGCTRL;
} SercomI2cm;




typedef struct {
  volatile SERCOM_I2CS_CTRLA_Type CTRLA;
  volatile SERCOM_I2CS_CTRLB_Type CTRLB;
       RoReg8 Reserved1[0xC];
  volatile SERCOM_I2CS_INTENCLR_Type INTENCLR;
       RoReg8 Reserved2[0x1];
  volatile SERCOM_I2CS_INTENSET_Type INTENSET;
       RoReg8 Reserved3[0x1];
  volatile SERCOM_I2CS_INTFLAG_Type INTFLAG;
       RoReg8 Reserved4[0x1];
  volatile SERCOM_I2CS_STATUS_Type STATUS;
  volatile const SERCOM_I2CS_SYNCBUSY_Type SYNCBUSY;
       RoReg8 Reserved5[0x4];
  volatile SERCOM_I2CS_ADDR_Type ADDR;
  volatile SERCOM_I2CS_DATA_Type DATA;
} SercomI2cs;




typedef struct {
  volatile SERCOM_SPI_CTRLA_Type CTRLA;
  volatile SERCOM_SPI_CTRLB_Type CTRLB;
       RoReg8 Reserved1[0x4];
  volatile SERCOM_SPI_BAUD_Type BAUD;
       RoReg8 Reserved2[0x7];
  volatile SERCOM_SPI_INTENCLR_Type INTENCLR;
       RoReg8 Reserved3[0x1];
  volatile SERCOM_SPI_INTENSET_Type INTENSET;
       RoReg8 Reserved4[0x1];
  volatile SERCOM_SPI_INTFLAG_Type INTFLAG;
       RoReg8 Reserved5[0x1];
  volatile SERCOM_SPI_STATUS_Type STATUS;
  volatile const SERCOM_SPI_SYNCBUSY_Type SYNCBUSY;
       RoReg8 Reserved6[0x4];
  volatile SERCOM_SPI_ADDR_Type ADDR;
  volatile SERCOM_SPI_DATA_Type DATA;
       RoReg8 Reserved7[0x4];
  volatile SERCOM_SPI_DBGCTRL_Type DBGCTRL;
} SercomSpi;




typedef struct {
  volatile SERCOM_USART_CTRLA_Type CTRLA;
  volatile SERCOM_USART_CTRLB_Type CTRLB;
       RoReg8 Reserved1[0x4];
  volatile SERCOM_USART_BAUD_Type BAUD;
  volatile SERCOM_USART_RXPL_Type RXPL;
       RoReg8 Reserved2[0x5];
  volatile SERCOM_USART_INTENCLR_Type INTENCLR;
       RoReg8 Reserved3[0x1];
  volatile SERCOM_USART_INTENSET_Type INTENSET;
       RoReg8 Reserved4[0x1];
  volatile SERCOM_USART_INTFLAG_Type INTFLAG;
       RoReg8 Reserved5[0x1];
  volatile SERCOM_USART_STATUS_Type STATUS;
  volatile const SERCOM_USART_SYNCBUSY_Type SYNCBUSY;
       RoReg8 Reserved6[0x8];
  volatile SERCOM_USART_DATA_Type DATA;
       RoReg8 Reserved7[0x6];
  volatile SERCOM_USART_DBGCTRL_Type DBGCTRL;
} SercomUsart;



typedef union {
       SercomI2cm I2CM;
       SercomI2cs I2CS;
       SercomSpi SPI;
       SercomUsart USART;
} Sercom;
# 241 "include/samd10c13a.h" 2
# 1 "include/component/sysctrl.h" 1
# 61 "include/component/sysctrl.h"
typedef union {
  struct {
    uint32_t XOSCRDY:1;
    uint32_t XOSC32KRDY:1;
    uint32_t OSC32KRDY:1;
    uint32_t OSC8MRDY:1;
    uint32_t DFLLRDY:1;
    uint32_t DFLLOOB:1;
    uint32_t DFLLLCKF:1;
    uint32_t DFLLLCKC:1;
    uint32_t DFLLRCS:1;
    uint32_t BOD33RDY:1;
    uint32_t BOD33DET:1;
    uint32_t B33SRDY:1;
    uint32_t :3;
    uint32_t DPLLLCKR:1;
    uint32_t DPLLLCKF:1;
    uint32_t DPLLLTO:1;
    uint32_t :14;
  } bit;
  uint32_t reg;
} SYSCTRL_INTENCLR_Type;
# 122 "include/component/sysctrl.h"
typedef union {
  struct {
    uint32_t XOSCRDY:1;
    uint32_t XOSC32KRDY:1;
    uint32_t OSC32KRDY:1;
    uint32_t OSC8MRDY:1;
    uint32_t DFLLRDY:1;
    uint32_t DFLLOOB:1;
    uint32_t DFLLLCKF:1;
    uint32_t DFLLLCKC:1;
    uint32_t DFLLRCS:1;
    uint32_t BOD33RDY:1;
    uint32_t BOD33DET:1;
    uint32_t B33SRDY:1;
    uint32_t :3;
    uint32_t DPLLLCKR:1;
    uint32_t DPLLLCKF:1;
    uint32_t DPLLLTO:1;
    uint32_t :14;
  } bit;
  uint32_t reg;
} SYSCTRL_INTENSET_Type;
# 183 "include/component/sysctrl.h"
typedef union {
  struct {
    volatile const uint32_t XOSCRDY:1;
    volatile const uint32_t XOSC32KRDY:1;
    volatile const uint32_t OSC32KRDY:1;
    volatile const uint32_t OSC8MRDY:1;
    volatile const uint32_t DFLLRDY:1;
    volatile const uint32_t DFLLOOB:1;
    volatile const uint32_t DFLLLCKF:1;
    volatile const uint32_t DFLLLCKC:1;
    volatile const uint32_t DFLLRCS:1;
    volatile const uint32_t BOD33RDY:1;
    volatile const uint32_t BOD33DET:1;
    volatile const uint32_t B33SRDY:1;
    volatile const uint32_t :3;
    volatile const uint32_t DPLLLCKR:1;
    volatile const uint32_t DPLLLCKF:1;
    volatile const uint32_t DPLLLTO:1;
    volatile const uint32_t :14;
  } bit;
  uint32_t reg;
} SYSCTRL_INTFLAG_Type;
# 244 "include/component/sysctrl.h"
typedef union {
  struct {
    uint32_t XOSCRDY:1;
    uint32_t XOSC32KRDY:1;
    uint32_t OSC32KRDY:1;
    uint32_t OSC8MRDY:1;
    uint32_t DFLLRDY:1;
    uint32_t DFLLOOB:1;
    uint32_t DFLLLCKF:1;
    uint32_t DFLLLCKC:1;
    uint32_t DFLLRCS:1;
    uint32_t BOD33RDY:1;
    uint32_t BOD33DET:1;
    uint32_t B33SRDY:1;
    uint32_t :3;
    uint32_t DPLLLCKR:1;
    uint32_t DPLLLCKF:1;
    uint32_t DPLLLTO:1;
    uint32_t :14;
  } bit;
  uint32_t reg;
} SYSCTRL_PCLKSR_Type;
# 305 "include/component/sysctrl.h"
typedef union {
  struct {
    uint16_t :1;
    uint16_t ENABLE:1;
    uint16_t XTALEN:1;
    uint16_t :3;
    uint16_t RUNSTDBY:1;
    uint16_t ONDEMAND:1;
    uint16_t GAIN:3;
    uint16_t AMPGC:1;
    uint16_t STARTUP:4;
  } bit;
  uint16_t reg;
} SYSCTRL_XOSC_Type;
