twitchyliquid64/samd10_boilerplate/compiled_samd10d13a.h
# 354 "include/component/sysctrl.h"
typedef union {
  struct {
    uint16_t :1;
    uint16_t ENABLE:1;
    uint16_t XTALEN:1;
    uint16_t EN32K:1;
    uint16_t EN1K:1;
    uint16_t AAMPEN:1;
    uint16_t RUNSTDBY:1;
    uint16_t ONDEMAND:1;
    uint16_t STARTUP:3;
    uint16_t :1;
    uint16_t WRTLOCK:1;
    uint16_t :3;
  } bit;
  uint16_t reg;
} SYSCTRL_XOSC32K_Type;
# 399 "include/component/sysctrl.h"
typedef union {
  struct {
    uint32_t :1;
    uint32_t ENABLE:1;
    uint32_t EN32K:1;
    uint32_t EN1K:1;
    uint32_t :2;
    uint32_t RUNSTDBY:1;
    uint32_t ONDEMAND:1;
    uint32_t STARTUP:3;
    uint32_t :1;
    uint32_t WRTLOCK:1;
    uint32_t :3;
    uint32_t CALIB:7;
    uint32_t :9;
  } bit;
  uint32_t reg;
} SYSCTRL_OSC32K_Type;
# 444 "include/component/sysctrl.h"
typedef union {
  struct {
    uint8_t CALIB:5;
    uint8_t :2;
    uint8_t WRTLOCK:1;
  } bit;
  uint8_t reg;
} SYSCTRL_OSCULP32K_Type;
# 466 "include/component/sysctrl.h"
typedef union {
  struct {
    uint32_t :1;
    uint32_t ENABLE:1;
    uint32_t :4;
    uint32_t RUNSTDBY:1;
    uint32_t ONDEMAND:1;
    uint32_t PRESC:2;
    uint32_t :6;
    uint32_t CALIB:12;
    uint32_t :2;
    uint32_t FRANGE:2;
  } bit;
  uint32_t reg;
} SYSCTRL_OSC8M_Type;
# 521 "include/component/sysctrl.h"
typedef union {
  struct {
    uint16_t :1;
    uint16_t ENABLE:1;
    uint16_t MODE:1;
    uint16_t STABLE:1;
    uint16_t LLAW:1;
    uint16_t USBCRM:1;
    uint16_t RUNSTDBY:1;
    uint16_t ONDEMAND:1;
    uint16_t CCDIS:1;
    uint16_t QLDIS:1;
    uint16_t BPLCKC:1;
    uint16_t WAITLOCK:1;
    uint16_t :4;
  } bit;
  uint16_t reg;
} SYSCTRL_DFLLCTRL_Type;
# 570 "include/component/sysctrl.h"
typedef union {
  struct {
    uint32_t FINE:10;
    uint32_t COARSE:6;
    uint32_t DIFF:16;
  } bit;
  uint32_t reg;
} SYSCTRL_DFLLVAL_Type;
# 596 "include/component/sysctrl.h"
typedef union {
  struct {
    uint32_t MUL:16;
    uint32_t FSTEP:10;
    uint32_t CSTEP:6;
  } bit;
  uint32_t reg;
} SYSCTRL_DFLLMUL_Type;
# 622 "include/component/sysctrl.h"
typedef union {
  struct {
    uint8_t :7;
    uint8_t READREQ:1;
  } bit;
  uint8_t reg;
} SYSCTRL_DFLLSYNC_Type;
# 640 "include/component/sysctrl.h"
typedef union {
  struct {
    uint32_t :1;
    uint32_t ENABLE:1;
    uint32_t HYST:1;
    uint32_t ACTION:2;
    uint32_t :1;
    uint32_t RUNSTDBY:1;
    uint32_t :1;
    uint32_t MODE:1;
    uint32_t CEN:1;
    uint32_t :2;
    uint32_t PSEL:4;
    uint32_t LEVEL:6;
    uint32_t :10;
  } bit;
  uint32_t reg;
} SYSCTRL_BOD33_Type;
# 724 "include/component/sysctrl.h"
typedef union {
  struct {
    uint32_t :1;
    uint32_t TSEN:1;
    uint32_t BGOUTEN:1;
    uint32_t :13;
    uint32_t CALIB:11;
    uint32_t :5;
  } bit;
  uint32_t reg;
} SYSCTRL_VREF_Type;
# 751 "include/component/sysctrl.h"
typedef union {
  struct {
    uint8_t :1;
    uint8_t ENABLE:1;
    uint8_t :4;
    uint8_t RUNSTDBY:1;
    uint8_t ONDEMAND:1;
  } bit;
  uint8_t reg;
} SYSCTRL_DPLLCTRLA_Type;
# 776 "include/component/sysctrl.h"
typedef union {
  struct {
    uint32_t LDR:12;
    uint32_t :4;
    uint32_t LDRFRAC:4;
    uint32_t :12;
  } bit;
  uint32_t reg;
} SYSCTRL_DPLLRATIO_Type;
# 800 "include/component/sysctrl.h"
typedef union {
  struct {
    uint32_t FILTER:2;
    uint32_t LPEN:1;
    uint32_t WUF:1;
    uint32_t REFCLK:2;
    uint32_t :2;
    uint32_t LTIME:3;
    uint32_t :1;
    uint32_t LBYPASS:1;
    uint32_t :3;
    uint32_t DIV:11;
    uint32_t :5;
  } bit;
  uint32_t reg;
} SYSCTRL_DPLLCTRLB_Type;
# 867 "include/component/sysctrl.h"
typedef union {
  struct {
    uint8_t LOCK:1;
    uint8_t CLKRDY:1;
    uint8_t ENABLE:1;
    uint8_t DIV:1;
    uint8_t :4;
  } bit;
  uint8_t reg;
} SYSCTRL_DPLLSTATUS_Type;
# 894 "include/component/sysctrl.h"
typedef struct {
  volatile SYSCTRL_INTENCLR_Type INTENCLR;
  volatile SYSCTRL_INTENSET_Type INTENSET;
  volatile SYSCTRL_INTFLAG_Type INTFLAG;
  volatile const SYSCTRL_PCLKSR_Type PCLKSR;
  volatile SYSCTRL_XOSC_Type XOSC;
       RoReg8 Reserved1[0x2];
  volatile SYSCTRL_XOSC32K_Type XOSC32K;
       RoReg8 Reserved2[0x2];
  volatile SYSCTRL_OSC32K_Type OSC32K;
  volatile SYSCTRL_OSCULP32K_Type OSCULP32K;
       RoReg8 Reserved3[0x3];
  volatile SYSCTRL_OSC8M_Type OSC8M;
  volatile SYSCTRL_DFLLCTRL_Type DFLLCTRL;
       RoReg8 Reserved4[0x2];
  volatile SYSCTRL_DFLLVAL_Type DFLLVAL;
  volatile SYSCTRL_DFLLMUL_Type DFLLMUL;
  volatile SYSCTRL_DFLLSYNC_Type DFLLSYNC;
       RoReg8 Reserved5[0x3];
  volatile SYSCTRL_BOD33_Type BOD33;
       RoReg8 Reserved6[0x8];
  volatile SYSCTRL_VREF_Type VREF;
  volatile SYSCTRL_DPLLCTRLA_Type DPLLCTRLA;
       RoReg8 Reserved7[0x3];
  volatile SYSCTRL_DPLLRATIO_Type DPLLRATIO;
  volatile SYSCTRL_DPLLCTRLB_Type DPLLCTRLB;
  volatile const SYSCTRL_DPLLSTATUS_Type DPLLSTATUS;
} Sysctrl;
# 242 "include/samd10c13a.h" 2
# 1 "include/component/tc.h" 1
# 61 "include/component/tc.h"
typedef union {
  struct {
    uint16_t SWRST:1;
    uint16_t ENABLE:1;
    uint16_t MODE:2;
    uint16_t :1;
    uint16_t WAVEGEN:2;
    uint16_t :1;
    uint16_t PRESCALER:3;
    uint16_t RUNSTDBY:1;
    uint16_t PRESCSYNC:2;
    uint16_t :2;
  } bit;
  uint16_t reg;
} TC_CTRLA_Type;
# 139 "include/component/tc.h"
typedef union {
  struct {
    uint16_t ADDR:5;
    uint16_t :9;
    uint16_t RCONT:1;
    uint16_t RREQ:1;
  } bit;
  uint16_t reg;
} TC_READREQ_Type;
# 164 "include/component/tc.h"
typedef union {
  struct {
    uint8_t DIR:1;
    uint8_t :1;
    uint8_t ONESHOT:1;
    uint8_t :3;
    uint8_t CMD:2;
  } bit;
  uint8_t reg;
} TC_CTRLBCLR_Type;
# 196 "include/component/tc.h"
typedef union {
  struct {
    uint8_t DIR:1;
    uint8_t :1;
    uint8_t ONESHOT:1;
    uint8_t :3;
    uint8_t CMD:2;
  } bit;
  uint8_t reg;
} TC_CTRLBSET_Type;
# 228 "include/component/tc.h"
typedef union {
  struct {
    uint8_t INVEN0:1;
    uint8_t INVEN1:1;
    uint8_t :2;
    uint8_t CPTEN0:1;
    uint8_t CPTEN1:1;
    uint8_t :2;
  } bit;
  struct {
    uint8_t INVEN:2;
    uint8_t :2;
    uint8_t CPTEN:2;
    uint8_t :2;
  } vec;
  uint8_t reg;
} TC_CTRLC_Type;
# 268 "include/component/tc.h"
typedef union {
  struct {
    uint8_t DBGRUN:1;
    uint8_t :7;
  } bit;
  uint8_t reg;
} TC_DBGCTRL_Type;
# 286 "include/component/tc.h"
typedef union {
  struct {
    uint16_t EVACT:3;
    uint16_t :1;
    uint16_t TCINV:1;
    uint16_t TCEI:1;
    uint16_t :2;
    uint16_t OVFEO:1;
    uint16_t :3;
    uint16_t MCEO0:1;
    uint16_t MCEO1:1;
    uint16_t :2;
  } bit;
  struct {
    uint16_t :12;
    uint16_t MCEO:2;
    uint16_t :2;
  } vec;
  uint16_t reg;
} TC_EVCTRL_Type;
