twitchyliquid64/samd10_boilerplate/compiled_samd10d13a.h
# 343 "include/component/tc.h"
typedef union {
  struct {
    uint8_t OVF:1;
    uint8_t ERR:1;
    uint8_t :1;
    uint8_t SYNCRDY:1;
    uint8_t MC0:1;
    uint8_t MC1:1;
    uint8_t :2;
  } bit;
  struct {
    uint8_t :4;
    uint8_t MC:2;
    uint8_t :2;
  } vec;
  uint8_t reg;
} TC_INTENCLR_Type;
# 382 "include/component/tc.h"
typedef union {
  struct {
    uint8_t OVF:1;
    uint8_t ERR:1;
    uint8_t :1;
    uint8_t SYNCRDY:1;
    uint8_t MC0:1;
    uint8_t MC1:1;
    uint8_t :2;
  } bit;
  struct {
    uint8_t :4;
    uint8_t MC:2;
    uint8_t :2;
  } vec;
  uint8_t reg;
} TC_INTENSET_Type;
# 421 "include/component/tc.h"
typedef union {
  struct {
    volatile const uint8_t OVF:1;
    volatile const uint8_t ERR:1;
    volatile const uint8_t :1;
    volatile const uint8_t SYNCRDY:1;
    volatile const uint8_t MC0:1;
    volatile const uint8_t MC1:1;
    volatile const uint8_t :2;
  } bit;
  struct {
    volatile const uint8_t :4;
    volatile const uint8_t MC:2;
    volatile const uint8_t :2;
  } vec;
  uint8_t reg;
} TC_INTFLAG_Type;
# 460 "include/component/tc.h"
typedef union {
  struct {
    uint8_t :3;
    uint8_t STOP:1;
    uint8_t SLAVE:1;
    uint8_t :2;
    uint8_t SYNCBUSY:1;
  } bit;
  uint8_t reg;
} TC_STATUS_Type;
# 485 "include/component/tc.h"
typedef union {
  struct {
    uint16_t COUNT:16;
  } bit;
  uint16_t reg;
} TC_COUNT16_COUNT_Type;
# 503 "include/component/tc.h"
typedef union {
  struct {
    uint32_t COUNT:32;
  } bit;
  uint32_t reg;
} TC_COUNT32_COUNT_Type;
# 521 "include/component/tc.h"
typedef union {
  struct {
    uint8_t COUNT:8;
  } bit;
  uint8_t reg;
} TC_COUNT8_COUNT_Type;
# 539 "include/component/tc.h"
typedef union {
  struct {
    uint8_t PER:8;
  } bit;
  uint8_t reg;
} TC_COUNT8_PER_Type;
# 557 "include/component/tc.h"
typedef union {
  struct {
    uint16_t CC:16;
  } bit;
  uint16_t reg;
} TC_COUNT16_CC_Type;
# 575 "include/component/tc.h"
typedef union {
  struct {
    uint32_t CC:32;
  } bit;
  uint32_t reg;
} TC_COUNT32_CC_Type;
# 593 "include/component/tc.h"
typedef union {
  struct {
    uint8_t CC:8;
  } bit;
  uint8_t reg;
} TC_COUNT8_CC_Type;
# 611 "include/component/tc.h"
typedef struct {
  volatile TC_CTRLA_Type CTRLA;
  volatile TC_READREQ_Type READREQ;
  volatile TC_CTRLBCLR_Type CTRLBCLR;
  volatile TC_CTRLBSET_Type CTRLBSET;
  volatile TC_CTRLC_Type CTRLC;
       RoReg8 Reserved1[0x1];
  volatile TC_DBGCTRL_Type DBGCTRL;
       RoReg8 Reserved2[0x1];
  volatile TC_EVCTRL_Type EVCTRL;
  volatile TC_INTENCLR_Type INTENCLR;
  volatile TC_INTENSET_Type INTENSET;
  volatile TC_INTFLAG_Type INTFLAG;
  volatile const TC_STATUS_Type STATUS;
  volatile TC_COUNT8_COUNT_Type COUNT;
       RoReg8 Reserved3[0x3];
  volatile TC_COUNT8_PER_Type PER;
       RoReg8 Reserved4[0x3];
  volatile TC_COUNT8_CC_Type CC[2];
} TcCount8;




typedef struct {
  volatile TC_CTRLA_Type CTRLA;
  volatile TC_READREQ_Type READREQ;
  volatile TC_CTRLBCLR_Type CTRLBCLR;
  volatile TC_CTRLBSET_Type CTRLBSET;
  volatile TC_CTRLC_Type CTRLC;
       RoReg8 Reserved1[0x1];
  volatile TC_DBGCTRL_Type DBGCTRL;
       RoReg8 Reserved2[0x1];
  volatile TC_EVCTRL_Type EVCTRL;
  volatile TC_INTENCLR_Type INTENCLR;
  volatile TC_INTENSET_Type INTENSET;
  volatile TC_INTFLAG_Type INTFLAG;
  volatile const TC_STATUS_Type STATUS;
  volatile TC_COUNT16_COUNT_Type COUNT;
       RoReg8 Reserved3[0x6];
  volatile TC_COUNT16_CC_Type CC[2];
} TcCount16;




typedef struct {
  volatile TC_CTRLA_Type CTRLA;
  volatile TC_READREQ_Type READREQ;
  volatile TC_CTRLBCLR_Type CTRLBCLR;
  volatile TC_CTRLBSET_Type CTRLBSET;
  volatile TC_CTRLC_Type CTRLC;
       RoReg8 Reserved1[0x1];
  volatile TC_DBGCTRL_Type DBGCTRL;
       RoReg8 Reserved2[0x1];
  volatile TC_EVCTRL_Type EVCTRL;
  volatile TC_INTENCLR_Type INTENCLR;
  volatile TC_INTENSET_Type INTENSET;
  volatile TC_INTFLAG_Type INTFLAG;
  volatile const TC_STATUS_Type STATUS;
  volatile TC_COUNT32_COUNT_Type COUNT;
       RoReg8 Reserved3[0x4];
  volatile TC_COUNT32_CC_Type CC[2];
} TcCount32;



typedef union {
       TcCount8 COUNT8;
       TcCount16 COUNT16;
       TcCount32 COUNT32;
} Tc;
# 243 "include/samd10c13a.h" 2
# 1 "include/component/tcc.h" 1
# 61 "include/component/tcc.h"
typedef union {
  struct {
    uint32_t SWRST:1;
    uint32_t ENABLE:1;
    uint32_t :3;
    uint32_t RESOLUTION:2;
    uint32_t :1;
    uint32_t PRESCALER:3;
    uint32_t RUNSTDBY:1;
    uint32_t PRESCSYNC:2;
    uint32_t ALOCK:1;
    uint32_t :9;
    uint32_t CPTEN0:1;
    uint32_t CPTEN1:1;
    uint32_t CPTEN2:1;
    uint32_t CPTEN3:1;
    uint32_t :4;
  } bit;
  struct {
    uint32_t :24;
    uint32_t CPTEN:4;
    uint32_t :4;
  } vec;
  uint32_t reg;
} TCC_CTRLA_Type;
# 153 "include/component/tcc.h"
typedef union {
  struct {
    uint8_t DIR:1;
    uint8_t LUPD:1;
    uint8_t ONESHOT:1;
    uint8_t IDXCMD:2;
    uint8_t CMD:3;
  } bit;
  uint8_t reg;
} TCC_CTRLBCLR_Type;
# 202 "include/component/tcc.h"
typedef union {
  struct {
    uint8_t DIR:1;
    uint8_t LUPD:1;
    uint8_t ONESHOT:1;
    uint8_t IDXCMD:2;
    uint8_t CMD:3;
  } bit;
  uint8_t reg;
} TCC_CTRLBSET_Type;
# 251 "include/component/tcc.h"
typedef union {
  struct {
    uint32_t SWRST:1;
    uint32_t ENABLE:1;
    uint32_t CTRLB:1;
    uint32_t STATUS:1;
    uint32_t COUNT:1;
    uint32_t PATT:1;
    uint32_t WAVE:1;
    uint32_t PER:1;
    uint32_t CC0:1;
    uint32_t CC1:1;
    uint32_t CC2:1;
    uint32_t CC3:1;
    uint32_t :4;
    uint32_t PATTB:1;
    uint32_t WAVEB:1;
    uint32_t PERB:1;
    uint32_t CCB0:1;
    uint32_t CCB1:1;
    uint32_t CCB2:1;
    uint32_t CCB3:1;
    uint32_t :9;
  } bit;
  struct {
    uint32_t :8;
    uint32_t CC:4;
    uint32_t :7;
    uint32_t CCB:4;
    uint32_t :9;
  } vec;
  uint32_t reg;
} TCC_SYNCBUSY_Type;
# 337 "include/component/tcc.h"
typedef union {
  struct {
    uint32_t SRC:2;
    uint32_t :1;
    uint32_t KEEP:1;
    uint32_t QUAL:1;
    uint32_t BLANK:2;
    uint32_t RESTART:1;
    uint32_t HALT:2;
    uint32_t CHSEL:2;
    uint32_t CAPTURE:3;
    uint32_t BLANKPRESC:1;
    uint32_t BLANKVAL:8;
    uint32_t FILTERVAL:4;
    uint32_t :4;
  } bit;
  uint32_t reg;
} TCC_FCTRLA_Type;
# 441 "include/component/tcc.h"
typedef union {
  struct {
    uint32_t SRC:2;
    uint32_t :1;
    uint32_t KEEP:1;
    uint32_t QUAL:1;
    uint32_t BLANK:2;
    uint32_t RESTART:1;
    uint32_t HALT:2;
    uint32_t CHSEL:2;
    uint32_t CAPTURE:3;
    uint32_t BLANKPRESC:1;
    uint32_t BLANKVAL:8;
    uint32_t FILTERVAL:4;
    uint32_t :4;
  } bit;
  uint32_t reg;
} TCC_FCTRLB_Type;
