twitchyliquid64/samd10_boilerplate/compiled_samd10d13a.h
# 545 "include/component/tcc.h"
typedef union {
  struct {
    uint32_t OTMX:2;
    uint32_t :6;
    uint32_t DTIEN0:1;
    uint32_t DTIEN1:1;
    uint32_t DTIEN2:1;
    uint32_t DTIEN3:1;
    uint32_t :4;
    uint32_t DTLS:8;
    uint32_t DTHS:8;
  } bit;
  struct {
    uint32_t :8;
    uint32_t DTIEN:4;
    uint32_t :20;
  } vec;
  uint32_t reg;
} TCC_WEXCTRL_Type;
# 593 "include/component/tcc.h"
typedef union {
  struct {
    uint32_t NRE0:1;
    uint32_t NRE1:1;
    uint32_t NRE2:1;
    uint32_t NRE3:1;
    uint32_t NRE4:1;
    uint32_t NRE5:1;
    uint32_t NRE6:1;
    uint32_t NRE7:1;
    uint32_t NRV0:1;
    uint32_t NRV1:1;
    uint32_t NRV2:1;
    uint32_t NRV3:1;
    uint32_t NRV4:1;
    uint32_t NRV5:1;
    uint32_t NRV6:1;
    uint32_t NRV7:1;
    uint32_t INVEN0:1;
    uint32_t INVEN1:1;
    uint32_t INVEN2:1;
    uint32_t INVEN3:1;
    uint32_t INVEN4:1;
    uint32_t INVEN5:1;
    uint32_t INVEN6:1;
    uint32_t INVEN7:1;
    uint32_t FILTERVAL0:4;
    uint32_t FILTERVAL1:4;
  } bit;
  struct {
    uint32_t NRE:8;
    uint32_t NRV:8;
    uint32_t INVEN:8;
    uint32_t :8;
  } vec;
  uint32_t reg;
} TCC_DRVCTRL_Type;
# 702 "include/component/tcc.h"
typedef union {
  struct {
    uint8_t DBGRUN:1;
    uint8_t :1;
    uint8_t FDDBD:1;
    uint8_t :5;
  } bit;
  uint8_t reg;
} TCC_DBGCTRL_Type;
# 724 "include/component/tcc.h"
typedef union {
  struct {
    uint32_t EVACT0:3;
    uint32_t EVACT1:3;
    uint32_t CNTSEL:2;
    uint32_t OVFEO:1;
    uint32_t TRGEO:1;
    uint32_t CNTEO:1;
    uint32_t :1;
    uint32_t TCINV0:1;
    uint32_t TCINV1:1;
    uint32_t TCEI0:1;
    uint32_t TCEI1:1;
    uint32_t MCEI0:1;
    uint32_t MCEI1:1;
    uint32_t MCEI2:1;
    uint32_t MCEI3:1;
    uint32_t :4;
    uint32_t MCEO0:1;
    uint32_t MCEO1:1;
    uint32_t MCEO2:1;
    uint32_t MCEO3:1;
    uint32_t :4;
  } bit;
  struct {
    uint32_t :12;
    uint32_t TCINV:2;
    uint32_t TCEI:2;
    uint32_t MCEI:4;
    uint32_t :4;
    uint32_t MCEO:4;
    uint32_t :4;
  } vec;
  uint32_t reg;
} TCC_EVCTRL_Type;
# 857 "include/component/tcc.h"
typedef union {
  struct {
    uint32_t OVF:1;
    uint32_t TRG:1;
    uint32_t CNT:1;
    uint32_t ERR:1;
    uint32_t :7;
    uint32_t DFS:1;
    uint32_t FAULTA:1;
    uint32_t FAULTB:1;
    uint32_t FAULT0:1;
    uint32_t FAULT1:1;
    uint32_t MC0:1;
    uint32_t MC1:1;
    uint32_t MC2:1;
    uint32_t MC3:1;
    uint32_t :12;
  } bit;
  struct {
    uint32_t :16;
    uint32_t MC:4;
    uint32_t :12;
  } vec;
  uint32_t reg;
} TCC_INTENCLR_Type;
# 920 "include/component/tcc.h"
typedef union {
  struct {
    uint32_t OVF:1;
    uint32_t TRG:1;
    uint32_t CNT:1;
    uint32_t ERR:1;
    uint32_t :7;
    uint32_t DFS:1;
    uint32_t FAULTA:1;
    uint32_t FAULTB:1;
    uint32_t FAULT0:1;
    uint32_t FAULT1:1;
    uint32_t MC0:1;
    uint32_t MC1:1;
    uint32_t MC2:1;
    uint32_t MC3:1;
    uint32_t :12;
  } bit;
  struct {
    uint32_t :16;
    uint32_t MC:4;
    uint32_t :12;
  } vec;
  uint32_t reg;
} TCC_INTENSET_Type;
# 983 "include/component/tcc.h"
typedef union {
  struct {
    volatile const uint32_t OVF:1;
    volatile const uint32_t TRG:1;
    volatile const uint32_t CNT:1;
    volatile const uint32_t ERR:1;
    volatile const uint32_t :7;
    volatile const uint32_t DFS:1;
    volatile const uint32_t FAULTA:1;
    volatile const uint32_t FAULTB:1;
    volatile const uint32_t FAULT0:1;
    volatile const uint32_t FAULT1:1;
    volatile const uint32_t MC0:1;
    volatile const uint32_t MC1:1;
    volatile const uint32_t MC2:1;
    volatile const uint32_t MC3:1;
    volatile const uint32_t :12;
  } bit;
  struct {
    volatile const uint32_t :16;
    volatile const uint32_t MC:4;
    volatile const uint32_t :12;
  } vec;
  uint32_t reg;
} TCC_INTFLAG_Type;
# 1046 "include/component/tcc.h"
typedef union {
  struct {
    uint32_t STOP:1;
    uint32_t IDX:1;
    uint32_t :1;
    uint32_t DFS:1;
    uint32_t SLAVE:1;
    uint32_t PATTBV:1;
    uint32_t WAVEBV:1;
    uint32_t PERBV:1;
    uint32_t FAULTAIN:1;
    uint32_t FAULTBIN:1;
    uint32_t FAULT0IN:1;
    uint32_t FAULT1IN:1;
    uint32_t FAULTA:1;
    uint32_t FAULTB:1;
    uint32_t FAULT0:1;
    uint32_t FAULT1:1;
    uint32_t CCBV0:1;
    uint32_t CCBV1:1;
    uint32_t CCBV2:1;
    uint32_t CCBV3:1;
    uint32_t :4;
    uint32_t CMP0:1;
    uint32_t CMP1:1;
    uint32_t CMP2:1;
    uint32_t CMP3:1;
    uint32_t :4;
  } bit;
  struct {
    uint32_t :16;
    uint32_t CCBV:4;
    uint32_t :4;
    uint32_t CMP:4;
    uint32_t :4;
  } vec;
  uint32_t reg;
} TCC_STATUS_Type;
# 1145 "include/component/tcc.h"
typedef union {
  struct {
    uint32_t :4;
    uint32_t COUNT:20;
    uint32_t :8;
  } DITH4;
  struct {
    uint32_t :5;
    uint32_t COUNT:19;
    uint32_t :8;
  } DITH5;
  struct {
    uint32_t :6;
    uint32_t COUNT:18;
    uint32_t :8;
  } DITH6;
  struct {
    uint32_t COUNT:24;
    uint32_t :8;
  } bit;
  uint32_t reg;
} TCC_COUNT_Type;
# 1197 "include/component/tcc.h"
typedef union {
  struct {
    uint16_t PGE0:1;
    uint16_t PGE1:1;
    uint16_t PGE2:1;
    uint16_t PGE3:1;
    uint16_t PGE4:1;
    uint16_t PGE5:1;
    uint16_t PGE6:1;
    uint16_t PGE7:1;
    uint16_t PGV0:1;
    uint16_t PGV1:1;
    uint16_t PGV2:1;
    uint16_t PGV3:1;
    uint16_t PGV4:1;
    uint16_t PGV5:1;
    uint16_t PGV6:1;
    uint16_t PGV7:1;
  } bit;
  struct {
    uint16_t PGE:8;
    uint16_t PGV:8;
  } vec;
  uint16_t reg;
} TCC_PATT_Type;
# 1269 "include/component/tcc.h"
typedef union {
  struct {
    uint32_t WAVEGEN:3;
    uint32_t :1;
    uint32_t RAMP:2;
    uint32_t :1;
    uint32_t CIPEREN:1;
    uint32_t CICCEN0:1;
    uint32_t CICCEN1:1;
    uint32_t CICCEN2:1;
    uint32_t CICCEN3:1;
    uint32_t :4;
    uint32_t POL0:1;
    uint32_t POL1:1;
    uint32_t POL2:1;
    uint32_t POL3:1;
    uint32_t :4;
    uint32_t SWAP0:1;
    uint32_t SWAP1:1;
    uint32_t SWAP2:1;
    uint32_t SWAP3:1;
    uint32_t :4;
  } bit;
  struct {
    uint32_t :8;
    uint32_t CICCEN:4;
    uint32_t :4;
    uint32_t POL:4;
    uint32_t :4;
    uint32_t SWAP:4;
    uint32_t :4;
  } vec;
  uint32_t reg;
} TCC_WAVE_Type;
# 1375 "include/component/tcc.h"
typedef union {
  struct {
    uint32_t DITHERCY:4;
    uint32_t PER:20;
    uint32_t :8;
  } DITH4;
  struct {
    uint32_t DITHERCY:5;
    uint32_t PER:19;
    uint32_t :8;
  } DITH5;
  struct {
    uint32_t DITHERCY:6;
    uint32_t PER:18;
    uint32_t :8;
  } DITH6;
  struct {
    uint32_t PER:24;
    uint32_t :8;
  } bit;
  uint32_t reg;
} TCC_PER_Type;
# 1436 "include/component/tcc.h"
typedef union {
  struct {
    uint32_t DITHERCY:4;
    uint32_t CC:20;
    uint32_t :8;
  } DITH4;
  struct {
    uint32_t DITHERCY:5;
    uint32_t CC:19;
    uint32_t :8;
  } DITH5;
  struct {
    uint32_t DITHERCY:6;
    uint32_t CC:18;
    uint32_t :8;
  } DITH6;
  struct {
    uint32_t CC:24;
    uint32_t :8;
  } bit;
  uint32_t reg;
} TCC_CC_Type;
# 1497 "include/component/tcc.h"
typedef union {
  struct {
    uint16_t PGEB0:1;
    uint16_t PGEB1:1;
    uint16_t PGEB2:1;
    uint16_t PGEB3:1;
    uint16_t PGEB4:1;
    uint16_t PGEB5:1;
    uint16_t PGEB6:1;
    uint16_t PGEB7:1;
    uint16_t PGVB0:1;
    uint16_t PGVB1:1;
    uint16_t PGVB2:1;
    uint16_t PGVB3:1;
    uint16_t PGVB4:1;
    uint16_t PGVB5:1;
    uint16_t PGVB6:1;
    uint16_t PGVB7:1;
  } bit;
  struct {
    uint16_t PGEB:8;
    uint16_t PGVB:8;
  } vec;
  uint16_t reg;
} TCC_PATTB_Type;
