twitchyliquid64/samd10_boilerplate/compiled_samd10d13a.h
# 1569 "include/component/tcc.h"
typedef union {
  struct {
    uint32_t WAVEGENB:3;
    uint32_t :1;
    uint32_t RAMPB:2;
    uint32_t :1;
    uint32_t CIPERENB:1;
    uint32_t CICCENB0:1;
    uint32_t CICCENB1:1;
    uint32_t CICCENB2:1;
    uint32_t CICCENB3:1;
    uint32_t :4;
    uint32_t POLB0:1;
    uint32_t POLB1:1;
    uint32_t POLB2:1;
    uint32_t POLB3:1;
    uint32_t :4;
    uint32_t SWAPB0:1;
    uint32_t SWAPB1:1;
    uint32_t SWAPB2:1;
    uint32_t SWAPB3:1;
    uint32_t :4;
  } bit;
  struct {
    uint32_t :8;
    uint32_t CICCENB:4;
    uint32_t :4;
    uint32_t POLB:4;
    uint32_t :4;
    uint32_t SWAPB:4;
    uint32_t :4;
  } vec;
  uint32_t reg;
} TCC_WAVEB_Type;
# 1673 "include/component/tcc.h"
typedef union {
  struct {
    uint32_t DITHERCYB:4;
    uint32_t PERB:20;
    uint32_t :8;
  } DITH4;
  struct {
    uint32_t DITHERCYB:5;
    uint32_t PERB:19;
    uint32_t :8;
  } DITH5;
  struct {
    uint32_t DITHERCYB:6;
    uint32_t PERB:18;
    uint32_t :8;
  } DITH6;
  struct {
    uint32_t PERB:24;
    uint32_t :8;
  } bit;
  uint32_t reg;
} TCC_PERB_Type;
# 1734 "include/component/tcc.h"
typedef union {
  struct {
    uint32_t DITHERCYB:4;
    uint32_t CCB:20;
    uint32_t :8;
  } DITH4;
  struct {
    uint32_t DITHERCYB:5;
    uint32_t CCB:19;
    uint32_t :8;
  } DITH5;
  struct {
    uint32_t DITHERCYB:6;
    uint32_t CCB:18;
    uint32_t :8;
  } DITH6;
  struct {
    uint32_t CCB:24;
    uint32_t :8;
  } bit;
  uint32_t reg;
} TCC_CCB_Type;
# 1795 "include/component/tcc.h"
typedef struct {
  volatile TCC_CTRLA_Type CTRLA;
  volatile TCC_CTRLBCLR_Type CTRLBCLR;
  volatile TCC_CTRLBSET_Type CTRLBSET;
       RoReg8 Reserved1[0x2];
  volatile const TCC_SYNCBUSY_Type SYNCBUSY;
  volatile TCC_FCTRLA_Type FCTRLA;
  volatile TCC_FCTRLB_Type FCTRLB;
  volatile TCC_WEXCTRL_Type WEXCTRL;
  volatile TCC_DRVCTRL_Type DRVCTRL;
       RoReg8 Reserved2[0x2];
  volatile TCC_DBGCTRL_Type DBGCTRL;
       RoReg8 Reserved3[0x1];
  volatile TCC_EVCTRL_Type EVCTRL;
  volatile TCC_INTENCLR_Type INTENCLR;
  volatile TCC_INTENSET_Type INTENSET;
  volatile TCC_INTFLAG_Type INTFLAG;
  volatile TCC_STATUS_Type STATUS;
  volatile TCC_COUNT_Type COUNT;
  volatile TCC_PATT_Type PATT;
       RoReg8 Reserved4[0x2];
  volatile TCC_WAVE_Type WAVE;
  volatile TCC_PER_Type PER;
  volatile TCC_CC_Type CC[4];
       RoReg8 Reserved5[0x10];
  volatile TCC_PATTB_Type PATTB;
       RoReg8 Reserved6[0x2];
  volatile TCC_WAVEB_Type WAVEB;
  volatile TCC_PERB_Type PERB;
  volatile TCC_CCB_Type CCB[4];
} Tcc;
# 244 "include/samd10c13a.h" 2
# 1 "include/component/wdt.h" 1
# 61 "include/component/wdt.h"
typedef union {
  struct {
    uint8_t :1;
    uint8_t ENABLE:1;
    uint8_t WEN:1;
    uint8_t :4;
    uint8_t ALWAYSON:1;
  } bit;
  uint8_t reg;
} WDT_CTRL_Type;
# 86 "include/component/wdt.h"
typedef union {
  struct {
    uint8_t PER:4;
    uint8_t WINDOW:4;
  } bit;
  uint8_t reg;
} WDT_CONFIG_Type;
# 156 "include/component/wdt.h"
typedef union {
  struct {
    uint8_t EWOFFSET:4;
    uint8_t :4;
  } bit;
  uint8_t reg;
} WDT_EWCTRL_Type;
# 199 "include/component/wdt.h"
typedef union {
  struct {
    uint8_t EW:1;
    uint8_t :7;
  } bit;
  uint8_t reg;
} WDT_INTENCLR_Type;
# 217 "include/component/wdt.h"
typedef union {
  struct {
    uint8_t EW:1;
    uint8_t :7;
  } bit;
  uint8_t reg;
} WDT_INTENSET_Type;
# 235 "include/component/wdt.h"
typedef union {
  struct {
    volatile const uint8_t EW:1;
    volatile const uint8_t :7;
  } bit;
  uint8_t reg;
} WDT_INTFLAG_Type;
# 253 "include/component/wdt.h"
typedef union {
  struct {
    uint8_t :7;
    uint8_t SYNCBUSY:1;
  } bit;
  uint8_t reg;
} WDT_STATUS_Type;
# 271 "include/component/wdt.h"
typedef union {
  struct {
    uint8_t CLEAR:8;
  } bit;
  uint8_t reg;
} WDT_CLEAR_Type;
# 291 "include/component/wdt.h"
typedef struct {
  volatile WDT_CTRL_Type CTRL;
  volatile WDT_CONFIG_Type CONFIG;
  volatile WDT_EWCTRL_Type EWCTRL;
       RoReg8 Reserved1[0x1];
  volatile WDT_INTENCLR_Type INTENCLR;
  volatile WDT_INTENSET_Type INTENSET;
  volatile WDT_INTFLAG_Type INTFLAG;
  volatile const WDT_STATUS_Type STATUS;
  volatile WDT_CLEAR_Type CLEAR;
} Wdt;
# 245 "include/samd10c13a.h" 2
# 253 "include/samd10c13a.h"
# 1 "include/instance/ac.h" 1
# 254 "include/samd10c13a.h" 2
# 1 "include/instance/adc.h" 1
# 255 "include/samd10c13a.h" 2
# 1 "include/instance/dac.h" 1
# 256 "include/samd10c13a.h" 2
# 1 "include/instance/dmac.h" 1
# 257 "include/samd10c13a.h" 2
# 1 "include/instance/dsu.h" 1
# 258 "include/samd10c13a.h" 2
# 1 "include/instance/eic.h" 1
# 259 "include/samd10c13a.h" 2
# 1 "include/instance/evsys.h" 1
# 260 "include/samd10c13a.h" 2
# 1 "include/instance/gclk.h" 1
# 261 "include/samd10c13a.h" 2
# 1 "include/instance/sbmatrix.h" 1
# 262 "include/samd10c13a.h" 2
# 1 "include/instance/mtb.h" 1
# 263 "include/samd10c13a.h" 2
# 1 "include/instance/nvmctrl.h" 1
# 264 "include/samd10c13a.h" 2
# 1 "include/instance/pac0.h" 1
# 265 "include/samd10c13a.h" 2
# 1 "include/instance/pac1.h" 1
# 266 "include/samd10c13a.h" 2
# 1 "include/instance/pac2.h" 1
# 267 "include/samd10c13a.h" 2
# 1 "include/instance/pm.h" 1
# 268 "include/samd10c13a.h" 2
# 1 "include/instance/port.h" 1
# 269 "include/samd10c13a.h" 2
# 1 "include/instance/rtc.h" 1
# 270 "include/samd10c13a.h" 2
# 1 "include/instance/sercom0.h" 1
# 271 "include/samd10c13a.h" 2
# 1 "include/instance/sercom1.h" 1
# 272 "include/samd10c13a.h" 2
# 1 "include/instance/sysctrl.h" 1
# 273 "include/samd10c13a.h" 2
# 1 "include/instance/tc1.h" 1
# 274 "include/samd10c13a.h" 2
# 1 "include/instance/tc2.h" 1
# 275 "include/samd10c13a.h" 2
# 1 "include/instance/tcc0.h" 1
# 276 "include/samd10c13a.h" 2
# 1 "include/instance/wdt.h" 1
# 277 "include/samd10c13a.h" 2
# 464 "include/samd10c13a.h"
# 1 "include/pio/samd10c13a.h" 1
# 465 "include/samd10c13a.h" 2
# 59 "include/samd10.h" 2
